{
  "id": "pci-dss-4-0-1",
  "name": "PCI DSS 4.0.1",
  "version": "4.0.1",
  "description": "Payment Card Industry Data Security Standard - A set of security standards designed to ensure that all companies that accept, process, store or transmit credit card information maintain a secure environment.",
  "source": "PCI Security Standards Council",
  "category": "industry",
  "requirements": [
    {
      "reference": "Req 1",
      "title": "Install and Maintain Network Security Controls",
      "description": "Network security controls (NSCs), such as firewalls and other network security technologies, are network policy enforcement points that typically control network traffic between two or more logical or physical network segments.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "1.1",
          "title": "Processes and mechanisms for installing and maintaining network security controls are defined and understood",
          "description": "Processes and mechanisms for installing and maintaining network security controls are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "1.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 1 are: \r\n•\t Documented.\r\n•\t Kept up to date.\r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 1 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "1.2",
          "title": "Network security controls (NSCs) are configured and maintained",
          "description": "Network security controls (NSCs) are configured and maintained.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "1.2.1",
              "title": "Configuration standards for NSCs defined and implemented",
              "description": "Configuration standards for NSC rulesets are:\r\n•\t Defined.\r\n•\t Implemented.\r\n•\t Maintained.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.2",
              "title": "Changes to network connections reviewed and approved",
              "description": "All changes to network connections and to configurations of NSCs are approved and managed in accordance with the change control process defined at Requirement 6.5.1.",
              "guidance": "Changes to network connections include the addition, removal, or modification of a connection. \r\nChanges to NSC configurations include those related to the component itself as well as those affecting how it performs its security function.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.3",
              "title": "Accurate network diagram maintained",
              "description": "An accurate network diagram(s) is maintained that shows all connections between the CDE and other networks, including any wireless networks.",
              "guidance": "A current network diagram(s) or other technical or topological solution that identifies network connections and devices can be used to meet this requirement.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.4",
              "title": "Accurate data-flow diagram maintained",
              "description": "An accurate data-flow diagram(s) is maintained that meets the following:  \r\n•\t Shows all account data flows across systems and networks.\r\n•\t Updated as needed upon changes to the environment.",
              "guidance": "A data-flow diagram(s) or other technical or topological solution that identifies flows of account data across systems and networks can be used to meet this requirement.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.5",
              "title": "Allowed services, protocols, and ports identified",
              "description": "All services, protocols and ports allowed  are identified, approved, and have a defined business need.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.6",
              "title": "Security features defined for insecure services",
              "description": "Security features are defined and implemented for all services, protocols, and ports that are in use and considered to be insecure, such that the risk is mitigated.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.7",
              "title": "NSC configurations reviewed at least every six months",
              "description": "Configurations of NSCs are reviewed at least once every six months to confirm they are relevant and effective.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.2.8",
              "title": "Configuration files secured and synchronized",
              "description": "Configuration files for NSCs are: \r\n•\t Secured from unauthorized access. \r\n•\t Kept consistent with active network configurations.",
              "guidance": "Any file or setting used to configure or synchronize NSCs is considered to be a “configuration file.” This includes files, automated and system-based controls, scripts, settings, infrastructure as code, or other parameters that are backed up, archived, or stored remotely.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "1.3",
          "title": "Network access to and from the cardholder data environment is restricted",
          "description": "Network access to and from the cardholder data environment is restricted.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "1.3.1",
              "title": "Inbound traffic to CDE restricted",
              "description": "Inbound traffic to the CDE is restricted as follows: \r\n•\t To only traffic that is necessary, \r\n•\t All other traffic is specifically denied.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.3.2",
              "title": "Outbound traffic from CDE restricted",
              "description": "Outbound traffic from the CDE is restricted as follows: \r\n•\t To only traffic that is necessary.\r\n•\t All other traffic is specifically denied.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.3.3",
              "title": "NSCs installed between wireless networks and CDE",
              "description": "NSCs are installed between all wireless networks and the CDE, regardless of whether the wireless network is a CDE, such that: \r\n•\t All wireless traffic from wireless networks into the CDE is denied by default.\r\n•\t Only wireless traffic with an authorized business purpose is allowed into the CDE.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "1.4",
          "title": "Network connections between trusted and untrusted networks are controlled",
          "description": "Network connections between trusted and untrusted networks are controlled.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "1.4.1",
              "title": "NSCs implemented between trusted and untrusted networks",
              "description": "NSCs are implemented between trusted and untrusted networks.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.4.2",
              "title": "Inbound traffic from untrusted to trusted restricted",
              "description": "Inbound traffic from untrusted networks to trusted networks is restricted to: \r\n•\t Communications with system components that are authorized to provide publicly accessible services, protocols, and ports.\r\n•\t Stateful responses to communications initiated by system components in a trusted network.\r\n•\t All other traffic is denied.",
              "guidance": "The intent of this requirement is to address communication sessions between trusted and untrusted networks, rather than the specifics of protocols.\r\nThis requirement does not limit the use of UDP or other connectionless network protocols if state is maintained by the NSC.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.4.3",
              "title": "Anti-spoofing measures implemented",
              "description": "Anti-spoofing measures are implemented to detect and block forged source IP addresses from entering the trusted network.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.4.4",
              "title": "System components storing cardholder data not directly accessible",
              "description": "System components that store cardholder data are not directly accessible from untrusted networks.",
              "guidance": "This requirement is not intended to apply to storage of account data in volatile memory but does apply where memory is being treated as persistent storage (for example, RAM disk). Account data can only be stored in volatile memory during the time necessary to support the associated business process (for example, until completion of the related payment card transaction).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "1.4.5",
              "title": "Disclosure of internal IP addresses prevented",
              "description": "The disclosure of internal IP addresses and routing information is limited to only authorized parties.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "1.5",
          "title": "Risks to the CDE from computing devices able to connect to both untrusted networks and the CDE are mitigated",
          "description": "Risks to the CDE from computing devices that are able to connect to both untrusted networks and the CDE are mitigated.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "1.5.1",
              "title": "Security controls implemented for devices connecting to both",
              "description": "Security controls are implemented on any computing devices, including company- and employee-owned devices, that connect to both untrusted networks (including the Internet) and the CDE as follows. \r\n•\t Specific configuration settings are defined to prevent threats being introduced into the entity’s network. \r\n•\t Security controls are actively running.\r\n•\t Security controls are not alterable by users of the computing devices unless specifically documented and authorized by management on a case-by-case basis for a limited period.",
              "guidance": "These security controls may be temporarily disabled only if there is legitimate technical need, as authorized by management on a case-by-case basis. If these security controls need to be disabled for a specific purpose, it must be formally authorized. Additional security measures may also need to be implemented for the period during which these security controls are not active.\r\nThis requirement applies to employee-owned and company-owned computing devices. Systems that cannot be managed by corporate policy introduce weaknesses and provide opportunities that malicious individuals may exploit.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 2",
      "title": "Apply Secure Configurations to All System Components",
      "description": "Malicious individuals often use default passwords and other vendor default settings to compromise systems. These passwords and settings are well known and easily determined.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "2.1",
          "title": "Processes and mechanisms for applying secure configurations are defined and understood",
          "description": "Processes and mechanisms for applying secure configurations to all system components are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "2.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 2 are: \r\n•\t Documented.\r\n•\t Kept up to date.\r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 2 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "2.2",
          "title": "System components are configured and managed securely",
          "description": "System components are configured and managed securely.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "2.2.1",
              "title": "Configuration standards developed for all system components",
              "description": "Configuration standards are developed, implemented, and maintained to:\r\n•\t Cover all system components.\r\n•\t Address all known security vulnerabilities. \r\n•\t Be consistent with industry-accepted system hardening standards or vendor hardening recommendations. \r\n•\t Be updated as new vulnerability issues are identified, as defined in Requirement 6.3.1.\r\n•\t Be applied when new systems are configured and verified as in place before or immediately after a system component is connected to a production environment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.2.2",
              "title": "Vendor default accounts managed",
              "description": "Vendor default accounts are managed as follows:\r\n•\t If the vendor default account(s) will be used, the default password is changed per Requirement 8.3.6.\r\n•\t If the vendor default account(s) will not be used, the account is removed or disabled.",
              "guidance": "This applies to ALL vendor default accounts and passwords, including, but not limited to, those used by operating systems, software that provides security services, application and system accounts, point-of-sale (POS) terminals, payment applications, and Simple Network Management Protocol (SNMP) defaults.\r\nThis requirement also applies where a system component is not installed within an entity’s environment, for example, software and applications that are part of the CDE and are accessed via a cloud subscription service.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.2.3",
              "title": "Primary functions requiring different security levels separated",
              "description": "Primary functions requiring different security levels are managed as follows: \r\n•\t Only one primary function exists on a system component,\r\nOR\r\n•\t Primary functions with differing security levels that exist on the same system component are isolated from each other,\r\nOR\r\n•\t Primary functions with differing security levels on the same system component are all secured to the level required by the function with the highest security need.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.2.4",
              "title": "Only necessary services and protocols enabled",
              "description": "Only necessary services, protocols, daemons, and functions are enabled, and all unnecessary functionality is removed or disabled.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.2.5",
              "title": "Insecure services and protocols secured",
              "description": "If any insecure services, protocols, or daemons are present: \r\n•\t Business justification is documented.\r\n•\t Additional security features are documented and implemented that reduce the risk of using insecure services, protocols, or daemons.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.2.6",
              "title": "System security parameters configured to prevent misuse",
              "description": "System security parameters are configured to prevent misuse.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.2.7",
              "title": "Non-console administrative access encrypted",
              "description": "All non-console administrative access is encrypted using strong cryptography.",
              "guidance": "This includes administrative access via browser-based interfaces and application programming interfaces (APIs).",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "2.3",
          "title": "Wireless environments are configured and managed securely",
          "description": "Wireless environments are configured and managed securely.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "2.3.1",
              "title": "Wireless vendor defaults changed for environments connected to CDE",
              "description": "For wireless environments connected to the CDE or transmitting account data, all wireless vendor defaults are changed at installation or are confirmed to be secure, including but not limited to:\r\n•\t Default wireless encryption keys.\r\n•\t Passwords on wireless access points.\r\n•\t SNMP defaults,\r\n•\t Any other security-related wireless vendor defaults.",
              "guidance": "This includes, but is not limited to, default wireless encryption keys, passwords on wireless access points, SNMP defaults, and any other security-related wireless vendor defaults.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "2.3.2",
              "title": "Wireless encryption keys changed appropriately",
              "description": "For wireless environments connected to the CDE or transmitting account data, wireless encryption keys are changed as follows: \r\n•\t Whenever personnel with knowledge of the key leave the company or the role for which the knowledge was necessary.\r\n•\t Whenever a key is suspected of or known to be compromised.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 3",
      "title": "Protect Stored Account Data",
      "description": "Protection methods such as encryption, truncation, masking, and hashing are critical components of account data protection.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "3.1",
          "title": "Processes and mechanisms for protecting stored account data are defined and understood",
          "description": "Processes and mechanisms for performing activities in Requirement 3 are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 3 are: \r\n•\tDocumented. \r\n•\tKept up to date. \r\n•\tIn use.\r\n•\tKnown to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 3 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "3.2",
          "title": "Storage of account data is kept to a minimum",
          "description": "Storage of account data is kept to a minimum.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.2.1",
              "title": "Data retention and disposal policies implemented",
              "description": "Account data storage is kept to a minimum through implementation of data retention and disposal policies, procedures, and processes that include at least the following:\r\n•\t Coverage for all locations of stored account data.\r\n•\t Coverage for any sensitive authentication data (SAD) stored prior to completion of authorization. This bullet is a best practice until its effective date; refer to",
              "guidance": "below for details.\r\n•\t Limiting data storage amount and retention time to that which is required for legal or regulatory, and/or business requirements. \r\n•\t Specific retention requirements for stored account data that defines length of retention period and includes a documented business justification. \r\n•\t Processes for secure deletion or rendering account data unrecoverable when no longer needed per the retention policy.\r\n•\t A process for verifying, at least once every three months, that stored account data exceeding the defined retention period has been securely deleted or rendered unrecoverable. \r\nApplicability Notes\r\nWhere account data is stored by a TPSP (for example, in a cloud environment), entities are responsible for working with their service providers to understand how the TPSP meets this requirement for the entity. Considerations include ensuring that all geographic instances of a data element are securely deleted.\r\nThe bullet above (for coverage of SAD stored prior to completion of authorization) is a best practice until 31 March 2025, after which it will be required as part of Requirement 3.2.1 and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "3.3",
          "title": "Sensitive authentication data (SAD) is not stored after authorization",
          "description": "Sensitive authentication data is not stored after authorization.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.3.1",
              "title": "SAD not retained after authorization",
              "description": "SAD is not stored after authorization, even if encrypted. All sensitive authentication data received is rendered unrecoverable upon completion of the authorization process",
              "guidance": "Issuers and companies that support issuing services, where there is a legitimate and documented business need to store SAD, are not required to meet this requirement. A legitimate business need is one that is necessary for the performance of the function being provided by or for the issuer.  \r\nRefer to Requirement 3.3.3 for additional requirements specifically for these entities. \r\nSensitive authentication data includes the data cited in Requirements 3.3.1.1 through 3.3.1.3.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.3.1.1",
              "title": "Full contents of track not stored after authorization",
              "description": "The full contents of any track are not stored upon completion of the authorization process.",
              "guidance": "In the normal course of business, the following data elements from the track may need to be retained: \r\n•\t Cardholder name.\r\n•\t Primary account number (PAN).\r\n•\t Expiration date.\r\n•\t Service code.\r\nTo minimize risk, store securely only these data elements as needed for business.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.3.1.2",
              "title": "Card verification code not stored after authorization",
              "description": "The card verification code is not stored upon completion of the authorization process.",
              "guidance": "The card verification code is the three- or four-digit number printed on the front or back of a payment card used to verify card-not-present transactions.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.3.1.3",
              "title": "PIN and PIN block not stored after authorization",
              "description": "The personal identification number (PIN) and the PIN block are not stored upon completion of the authorization process.",
              "guidance": "PIN blocks are encrypted during the natural course of transaction processes, but even if an entity encrypts the PIN block again, it is still not allowed to be stored after the completion of the authorization process.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.3.2",
              "title": "SAD stored electronically prior to authorization encrypted",
              "description": "SAD that is stored electronically prior to completion of authorization is encrypted using strong cryptography.",
              "guidance": "Whether SAD is permitted to be stored prior to authorization is determined by the organizations that manage compliance programs (for example, payment brands and acquirers). Contact these organizations for any additional criteria.\r\nThis requirement applies to all storage of SAD, even if no PAN is present in the environment. \r\nRefer to Requirement 3.2.1 for an additional requirement that applies if SAD is stored prior to completion of authorization.\r\nIssuers and companies that support issuing services, where there is a legitimate and documented business need to store SAD, are not required to meet this requirement. A legitimate business need is one that is necessary for the performance of the function being provided by or for the issuer. \r\nRefer to Requirement 3.3.3 for requirements specifically for these entities. \r\nThis requirement does not replace how PIN blocks are required to be managed, nor does it mean that a properly encrypted PIN block needs to be encrypted again. \r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.3.3",
              "title": "Additional requirement for issuers storing SAD",
              "description": "Additional requirement for issuers and companies that support issuing services and store sensitive authentication data: Any storage of sensitive authentication data is: \r\n• Limited to that which is needed for a legitimate issuing business need and is secured.\r\n• Encrypted using strong cryptography. This bullet is a best practice until its effective date; refer to",
              "guidance": "below for details.\r\nApplicability Notes\r\nThis requirement applies only to issuers and companies that support issuing services and store sensitive authentication data. \r\nEntities that issue payment cards or that perform or support issuing services will often create and control sensitive authentication data as part of the issuing function. It is allowable for companies that perform, facilitate, or support issuing services to store sensitive authentication data ONLY IF they have a legitimate business need to store such data. \r\nA legitimate issuing business need is one that is necessary for the performance of the function being provided by or for the issuer.\r\nThe bullet above (for encrypting stored SAD with strong cryptography) is a best practice until 31 March 2025, after which it will be required as part of Requirement 3.3.3 and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "3.4",
          "title": "Access to displays of full PAN and ability to copy cardholder data are restricted",
          "description": "Access to displays of full PAN and ability to copy PAN are restricted.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.4.1",
              "title": "PAN masked when displayed",
              "description": "PAN is masked when displayed (the BIN and last four digits are the maximum number of digits to be displayed), such that only personnel with a legitimate business need can see more than the BIN and last four digits of the PAN.",
              "guidance": "This requirement does not supersede stricter requirements in place for displays of cardholder data—for example, legal or payment brand requirements for point-of-sale (POS) receipts.\r\nThis requirement relates to protection of PAN where it is displayed on screens, paper receipts, printouts, etc., and is not to be confused with Requirement 3.5.1 for protection of PAN when stored, processed, or transmitted.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.4.2",
              "title": "Technical controls prevent copying/relocation when using remote-access",
              "description": "When using remote-access technologies, technical controls prevent copy and/or relocation of PAN for all personnel, except for those with documented, explicit authorization and a legitimate, defined business need.",
              "guidance": "Storing or relocating PAN onto local hard drives, removable electronic media, and other storage devices brings these devices into scope for PCI DSS.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "3.5",
          "title": "Primary account number (PAN) is secured wherever it is stored",
          "description": "PAN is secured wherever it is stored.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.5.1",
              "title": "PAN rendered unreadable anywhere it is stored",
              "description": "PAN is rendered unreadable anywhere it is stored by using any of the following approaches: \r\n•\t One-way hashes based on strong cryptography of the entire PAN. \r\n•\t Truncation (hashing cannot be used to replace the truncated segment of PAN).\r\n•\t Index tokens.\r\n•\t Strong cryptography with associated key-management processes and procedures. \r\n•\t Where hashed and truncated versions of the same PAN, or different truncation formats of the same PAN, are present in an environment, additional controls are in place to ensure that the different versions cannot be correlated to reconstruct the original PAN.",
              "guidance": "This requirement applies to PANs stored in primary storage (databases, or flat files such as text files spreadsheets) as well as non-primary storage (backup, audit logs, exception, or troubleshooting logs). \r\nThis requirement does not preclude the use of temporary files containing cleartext PAN while encrypting and decrypting PAN.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.5.1.1",
              "title": "Hashes used to render PAN unreadable are keyed",
              "description": "Hashes used to render PAN unreadable (per the first bullet of Requirement 3.5.1), are keyed cryptographic hashes of the entire PAN, with associated key-management processes and procedures in accordance with Requirements 3.6 and 3.7.",
              "guidance": "All Applicability Notes for Requirement 3.5.1 also apply to this requirement.\r\nKey-management processes and procedures (Requirements 3.6 and 3.7) do not apply to system components used to generate individual keyed hashes of a PAN for comparison to another system if:\r\n•\t The system components only have access to one hash value at a time (hash values are not stored on the system)\r\nAND\r\n•\t There is no other account data stored on the same system as the hashes.\r\nThis requirement is considered a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment. This requirement will replace the bullet in Requirement 3.5.1 for one-way hashes once its effective date is reached.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.5.1.2",
              "title": "Disk-level encryption used only on removable media",
              "description": "If disk-level or partition-level encryption (rather than file-, column-, or field-level database encryption) is used to render PAN unreadable, it is implemented only as follows :\r\n•\t On removable electronic media\r\nOR\r\n•\t If used for non-removable electronic media, PAN is also rendered unreadable via another mechanism that meets Requirement 3.5.1. \r\nNote: Disk or partition encryption implementations must also meet all other PCI DSS encryption and key-management requirements.",
              "guidance": "This requirement applies to any encryption method that provides clear-text PAN automatically when a system runs, even though an authorized user has not specifically requested that data.\r\nWhile disk or partition encryption may still be present on these types of devices, it cannot be the only mechanism used to protect PAN stored on those systems. Any stored PAN must also be rendered unreadable per Requirement 3.5.1—for example, through truncation or a data-level encryption mechanism. Full disk encryption helps to protect data in the event of physical loss of a disk and therefore its use is appropriate only for removable electronic media storage devices.\r\nMedia that is part of a data center architecture (for example, hot-swappable drives, bulk tape-backups) is considered non-removable electronic media to which Requirement 3.5.1 applies. \r\nDisk or partition encryption implementations must also meet all other PCI DSS encryption and key-management requirements. \r\nFor issuers and companies that support issuing services: This requirement does not apply to PANs being accessed for real-time transaction processing. However, it does apply to PANs stored for other purposes.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.5.1.3",
              "title": "Disk-level encryption managed independently",
              "description": "If disk-level or partition-level encryption is used (rather than file-, column-, or field--level database encryption) to render PAN unreadable, it is managed as follows:, \r\n•\tLogical access is managed separately and independently of native operating system authentication and access control mechanisms. \r\n•\tDecryption keys are not associated with user accounts. \r\n•\tAuthentication factors (passwords, passphrases, or cryptographic keys) that allow access to unencrypted data are stored securely.",
              "guidance": "Disk or partition encryption implementations must also meet all other PCI DSS encryption and key-management requirements.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "3.6",
          "title": "Cryptographic keys used to protect stored account data are secured",
          "description": "Cryptographic keys used to protect stored account data are secured.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.6.1",
              "title": "Key management procedures documented and implemented",
              "description": "Procedures are defined and implemented to protect cryptographic keys used to protect stored account data against disclosure and misuse that include: \r\n•\t\t Access to keys is restricted to the fewest number of custodians necessary. \r\n•\t\t Key-encrypting keys are at least as strong as the data-encrypting keys they protect. \r\n•\t\t Key-encrypting keys are stored separately from data-encrypting keys. \r\n•\t\t Keys are stored securely in the fewest possible locations and forms.",
              "guidance": "This requirement applies to keys used to protect stored account data and to key-encrypting keys used to protect data-encrypting keys.\r\nThe requirement to protect keys used to protect stored account data from disclosure and misuse applies to both data-encrypting keys and key-encrypting keys. Because one key-encrypting key may grant access to many data-encrypting keys, the key-encrypting keys require strong protection measures.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.6.1.1",
              "title": "Additional requirement for service providers",
              "description": "Additional requirement for service providers only: A documented description of the cryptographic architecture is maintained that includes: \r\n•\t Details of all algorithms, protocols, and keys used for the protection of stored account data, including key strength and expiry date.\r\n•\t Preventing the use of the same cryptographic keys in production and test environments. This bullet is a best practice until its effective date; refer to",
              "guidance": "below for details.\r\n•\t Description of the key usage for each key. \r\n•\t Inventory of any hardware security modules (HSMs), key management systems (KMS), and other secure cryptographic devices (SCDs) used for key management, including type and location of devices, to support meeting Requirement 12.3.4.\r\nApplicability Notes\r\nThis requirement applies only when the entity being assessed is a service provider.\r\nIn cloud HSM implementations, responsibility for the cryptographic architecture according to this Requirement will be shared between the cloud provider and the cloud customer.\r\nThe bullet above (for including, in the cryptographic architecture, that the use of the same cryptographic keys in production and test is prevented) is a best practice until 31 March 2025, after which it will be required as part of Requirement 3.6.1.1 and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.6.1.2",
              "title": "Secret and private keys stored securely",
              "description": "Secret and private keys used to protect stored account data are stored in one (or more) of the following forms at all times: \r\n•\t Encrypted with a key-encrypting key that is at least as strong as the data-encrypting key, and that is stored separately from the data-encrypting key. \r\n•\t Within a secure cryptographic device (SCD), such as a hardware security module (HSM) or PTS-approved point-of-interaction device. \r\n•\t As at least two full-length key components or key shares, in accordance with an industry-accepted method.",
              "guidance": "It is not required that public keys be stored in one of these forms.\r\nCryptographic keys stored as part of a key management system (KMS) that employs SCDs are acceptable. \r\nA cryptographic key that is split into two parts does not meet this requirement. Secret or private keys stored as key components or key shares must be generated via one of the following: \r\n•\tUsing an approved random number generator and within an SCD, \r\nOR\r\n•\tAccording to ISO 19592 or equivalent industry standard for generation of secret key shares.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.6.1.3",
              "title": "Access to cleartext keys restricted",
              "description": "Access to cleartext cryptographic key components is restricted to the fewest number of custodians necessary.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.6.1.4",
              "title": "Keys stored in fewest possible locations",
              "description": "Cryptographic keys are stored in the fewest possible locations.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "3.7",
          "title": "Where cryptography is used, key management processes and procedures are defined and implemented",
          "description": "Where cryptography is used to protect stored account data, key management processes and procedures covering all aspects of the key lifecycle are defined and implemented.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "3.7.1",
              "title": "Key generation procedures defined",
              "description": "Key-management policies and procedures are implemented to include generation of strong cryptographic keys used to protect stored account data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.2",
              "title": "Key distribution procedures defined",
              "description": "Key-management policies and procedures are implemented to include secure distribution of cryptographic keys used to protect stored account data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.3",
              "title": "Key storage procedures defined",
              "description": "Key-management policies and procedures are implemented to include secure storage of cryptographic keys used to protect stored account data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.4",
              "title": "Key changes at cryptoperiod end defined",
              "description": "Key management policies and procedures are implemented for cryptographic key changes for keys that have reached the end of their cryptoperiod, as defined by the associated application vendor or key owner, and based on industry best practices and guidelines, including the following:\r\n•\t A defined cryptoperiod for each key type in use.\r\n•\t A process for key changes at the end of the defined cryptoperiod.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.5",
              "title": "Key retirement procedures defined",
              "description": "Key management policies procedures are implemented to include the retirement, replacement, or destruction of keys used to protect stored account data, as deemed necessary when: \r\n• \tThe key has reached the end of its defined cryptoperiod.\r\n• \t\tThe integrity of the key has been weakened, including when personnel with knowledge of a cleartext key component leaves the company, or the role for which the key component was known.\r\n• \t\tThe key is suspected of or known to be compromised. \r\nRetired or replaced keys are not used for encryption operations.",
              "guidance": "If retired or replaced cryptographic keys need to be retained, these keys must be securely archived (for example, by using a key-encryption key).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.6",
              "title": "Split knowledge and dual control for manual key operations",
              "description": "Where manual cleartext cryptographic key-management operations are performed by personnel, key-management policies and procedures are implemented including managing these operations using split knowledge and dual control.",
              "guidance": "This control is applicable for manual key-management operations. \r\nA cryptographic key that is simply split into two parts does not meet this requirement. Secret or private keys stored as key components or key shares must be generated via one of the following: \r\n• \tUsing an approved random number generator and within a secure cryptographic device (SCD), such as a hardware security module (HSM) or PTS-approved point-of-interaction device, \r\nOR\r\n• \tAccording to ISO 19592 or equivalent industry standard for generation of secret key shares.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.7",
              "title": "Prevention of unauthorized key substitution",
              "description": "Key management policies and procedures are implemented to include the prevention of unauthorized substitution of cryptographic keys.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.8",
              "title": "Key custodian acknowledgement of responsibilities",
              "description": "Key management policies and procedures are implemented to include that cryptographic key custodians formally acknowledge (in writing or electronically) that they understand and accept their key-custodian responsibilities.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "3.7.9",
              "title": "Additional requirement for service providers using cryptography",
              "description": "Additional requirement for service providers only: Where a service provider shares cryptographic keys with its customers for transmission or storage of account data, guidance on secure transmission, storage and updating of such keys is documented and distributed to the service provider's customers.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 4",
      "title": "Protect Cardholder Data with Strong Cryptography During Transmission",
      "description": "Sensitive information must be encrypted during transmission over networks that are easily accessed by malicious individuals.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "4.1",
          "title": "Processes and mechanisms for protecting cardholder data during transmission are defined and understood",
          "description": "Processes and mechanisms for performing activities in Requirement 4 are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "4.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 4 are:\r\n•\t Documented\r\n•\t Kept up to date\r\n•\t In use\r\n•\t Known to all affected parties",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "4.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 4 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "4.2",
          "title": "PAN is protected with strong cryptography during transmission",
          "description": "PAN is protected with strong cryptography during transmission.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "4.2.1",
              "title": "Strong cryptography used during transmission over open networks",
              "description": "Strong cryptography and security protocols are implemented as follows to safeguard PAN during transmission over open, public networks:\r\n•\t Only trusted keys and certificates are accepted.\r\n•\t Certificates used to safeguard PAN during transmission over open, public networks are confirmed as valid and are not expired or revoked. This bullet is a best practice until its effective date; refer to applicability notes below for details.\r\n•\t The protocol in use supports only secure versions or configurations and does not support fallback to, or use of insecure versions, algorithms, key sizes, or implementations.\r\n•\t The encryption strength is appropriate for the encryption methodology in use.",
              "guidance": "A self-signed certificate may also be acceptable if the certificate is issued by an internal CA within the organization, the certificate’s author is confirmed, and the certificate is verified—for example, via hash or signature—and has not expired. \r\nThe bullet above (for confirming that certificates used to safeguard PAN during transmission over open, public networks are valid and are not expired or revoked) is a best practice until 31 March 2025, after which it will be required as part of Requirement 4.2.1 and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "4.2.1.1",
              "title": "Inventory of trusted keys and certificates maintained",
              "description": "An inventory of the entity’s trusted keys and certificates is maintained.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "4.2.1.2",
              "title": "Wireless networks transmitting PAN use strong cryptography",
              "description": "Wireless networks transmitting PAN or connected to the CDE use industry best practices to implement strong cryptography for authentication and transmission.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "4.2.2",
              "title": "PAN secured when sent via end-user messaging",
              "description": "PAN is secured with strong cryptography whenever it is sent via end-user messaging technologies.",
              "guidance": "This requirement also applies if a customer, or other third-party, requests that PAN is sent to them via end-user messaging technologies.\r\nThere could be occurrences where an entity receives unsolicited cardholder data via an insecure communication channel that was not intended for transmissions of sensitive data. In this situation, the entity can choose to either include the channel in the scope of their CDE and secure it according to PCI DSS or delete the cardholder data and implement measures to prevent the channel from being used for cardholder data.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 5",
      "title": "Protect All Systems and Networks from Malicious Software",
      "description": "Malicious software (malware) is software or firmware designed to infiltrate or damage a computer system without the owner's knowledge or consent.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "5.1",
          "title": "Processes and mechanisms for protecting systems from malicious software are defined and understood",
          "description": "Processes and mechanisms for protecting all systems and networks from malicious software are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "5.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 5 are:\r\n•\t Documented\r\n•\t Kept up to date\r\n•\t In use\r\n•\t Known to all affected parties",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 5 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "5.2",
          "title": "Malware is prevented or detected and addressed",
          "description": "Malicious software (malware) is prevented, or detected and addressed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "5.2.1",
              "title": "Anti-malware solution(s) deployed on all system components",
              "description": "An anti-malware solution(s) is deployed on all system components, except for those system components identified in periodic evaluations per Requirement 5.2.3 that concludes the system components are not at risk from malware.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.2.2",
              "title": "Anti-malware solution detects all known malware types",
              "description": "The deployed anti-malware solution(s):\r\n•\t Detects all known types of malware.\r\n•\t Removes, blocks, or contains all known types of malware.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.2.3",
              "title": "System components not at risk for malware evaluated periodically",
              "description": "Any system components that are not at risk for malware are evaluated periodically to include the following: \r\n•\t A documented list of all system components not at risk for malware.\r\n•\t Identification and evaluation of evolving malware threats for those system components.\r\n•\t Confirmation whether such system components continue to not require anti-malware protection.",
              "guidance": "System components covered by this requirement are those for which there is no anti-malware solution deployed per Requirement 5.2.1.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.2.3.1",
              "title": "Frequency of evaluations defined in targeted risk analysis",
              "description": "The frequency of periodic evaluations of system components identified as not at risk for malware is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "5.3",
          "title": "Anti-malware mechanisms and processes are active, maintained, and monitored",
          "description": "Anti-malware mechanisms and processes are active, maintained, and monitored.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "5.3.1",
              "title": "Anti-malware solution kept current via automatic updates",
              "description": "The anti-malware solution(s) is kept current via automatic updates.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.3.2",
              "title": "Anti-malware solution performs periodic and active scans",
              "description": "The anti-malware solution(s):\r\n•\t Performs periodic scans and active or real-time scans\r\nOR \r\n•\t Performs continuous behavioral analysis of systems or processes.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.3.2.1",
              "title": "Frequency of periodic malware scans defined in risk analysis",
              "description": "If periodic malware scans are performed to meet Requirement 5.3.2, the frequency of scans is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1.",
              "guidance": "This requirement applies to entities conducting periodic malware scans to meet Requirement 5.3.2.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.3.3",
              "title": "Anti-malware solution for removable media",
              "description": "For removable electronic media, the anti-malware solution(s): \r\n• Performs automatic scans of when the media is inserted, connected, or logically mounted,\r\nOR\r\n• Performs continuous behavioral analysis of systems or processes when the media is inserted, connected, or logically mounted.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.3.4",
              "title": "Audit logs for anti-malware enabled and retained",
              "description": "Audit logs for the anti-malware solution(s) are enabled and retained in accordance with Requirement 10.5.1.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "5.3.5",
              "title": "Anti-malware cannot be disabled or altered by users",
              "description": "Anti-malware mechanisms cannot be disabled or altered by users, unless specifically documented, and authorized by management on a case-by-case basis for a limited time period.",
              "guidance": "Anti-malware solutions may be temporarily disabled only if there is a legitimate technical need, as authorized by management on a case-by-case basis. If anti-malware protection needs to be disabled for a specific purpose, it must be formally authorized. Additional security measures may also need to be implemented for the period during which anti-malware protection is not active.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "5.4",
          "title": "Anti-phishing mechanisms protect users against phishing attacks",
          "description": "Anti-phishing mechanisms protect users against phishing attacks.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "5.4.1",
              "title": "Processes and mechanisms to detect and protect against phishing",
              "description": "Processes and automated mechanisms are in place to detect and protect personnel against phishing attacks.",
              "guidance": "The focus of this requirement is on protecting personnel with access to system components in-scope for PCI DSS.\r\nMeeting this requirement for technical and automated controls to detect and protect personnel against phishing is not the same as Requirement 12.6.3.1 for security awareness training. Meeting this requirement does not also meet the requirement for providing personnel with security awareness training, and vice versa.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 6",
      "title": "Develop and Maintain Secure Systems and Software",
      "description": "Actors with bad intentions can use security vulnerabilities to gain privileged access to systems. Many of these vulnerabilities are fixed by vendor-provided security patches.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "6.1",
          "title": "Processes and mechanisms for developing and maintaining secure systems are defined and understood",
          "description": "Processes and mechanisms for developing and maintaining secure systems and software are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "6.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 6 are:\r\n•\t Documented.\r\n•\t Kept up to date.\r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 6 are documented, assigned, and understood. \r\nNew requirement - effective immediately",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "6.2",
          "title": "Bespoke and custom software are developed securely",
          "description": "Bespoke and custom software is developed securely.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "6.2.1",
              "title": "Bespoke software developed securely",
              "description": "Bespoke and custom software are developed securely, as follows:\r\n•\t Based on industry standards and/or best practices for secure development. \r\n•\t In accordance with PCI DSS (for example, secure authentication and logging). \r\n•\t Incorporating consideration of information security issues during each stage of the software development lifecycle.",
              "guidance": "This applies to all software developed for or by the entity for the entity’s own use. This includes both bespoke and custom software. This does not apply to third-party software.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.2.2",
              "title": "Software development personnel trained in secure coding",
              "description": "Software development personnel working on bespoke and custom software are trained at least once every 12 months as follows: \r\n•\t On software security relevant to their job function and development languages.\r\n•\t Including secure software design and secure coding techniques.\r\n•\t Including, if security testing tools are used, how to use the tools for detecting vulnerabilities in software.",
              "guidance": ":\r\nThis requirement for code reviews applies to all bespoke and custom software (both internal and public facing), as part of the system development lifecycle.\r\nPublic-facing web applications are also subject to additional controls, to address ongoing threats and vulnerabilities after implementation, as defined at PCI DSS Requirement 6.4.\r\nCode reviews may be performed using either manual or automated processes, or a combination of both.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.2.3",
              "title": "Bespoke software reviewed prior to release",
              "description": "Bespoke and custom software is reviewed prior to being released into production or to customers, to identify and correct potential coding vulnerabilities, as follows:\r\n•\t Code reviews ensure code is developed according to secure coding guidelines.\r\n•\t Code reviews look for both existing and emerging software vulnerabilities.\r\n•\t Appropriate corrections are implemented prior to release.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.2.3.1",
              "title": "Manual code reviews by qualified individuals",
              "description": "If manual code reviews are performed for bespoke and custom software prior to release to production, code changes are:\r\n•\t Reviewed by individuals other than the originating code author, and who are knowledgeable about code-review techniques and secure coding practices.\r\n•\t Reviewed and approved by management prior to release.",
              "guidance": "Manual code reviews can be conducted by knowledgeable internal personnel or knowledgeable third-party personnel.\r\nAn individual that has been formally granted accountability for release control and who is neither the original code author nor the code reviewer fulfills the criteria of being management.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.2.4",
              "title": "Software engineering techniques prevent common vulnerabilities",
              "description": "Software engineering techniques or other methods are defined and in use by software development personnel to prevent or mitigate common software attacks and related vulnerabilities for bespoke and custom software, including but not limited to the following:\r\n•\t Injection attacks, including SQL, LDAP, XPath, or other command, parameter, object, fault, or injection-type flaws.\r\n•\t Attacks on data and data structures, including attempts to manipulate buffers, pointers, input data, or shared data.\r\n•\t Attacks on cryptography usage, including attempts to exploit weak, insecure, or inappropriate cryptographic implementations, algorithms, cipher suites, or modes of operation.\r\n•\t Attacks on business logic, including attempts to abuse or bypass application features and functionalities through the manipulation of APIs, communication protocols and channels, client-side functionality, or other system/application functions and resources. This includes cross-site scripting (XSS) and cross-site request forgery (CSRF).\r\n• \t Attacks on access control mechanisms, including attempts to bypass or abuse identification, authentication, or authorization mechanisms, or attempts to exploit weaknesses in the implementation of such mechanisms.\r\n•\t Attacks via any “high-risk” vulnerabilities identified in the vulnerability identification process, as defined in Requirement 6.3.1.",
              "guidance": "This applies to all software developed for or by the entity for the entity’s own use. This includes both bespoke and custom software. This does not apply to third-party software.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "6.3",
          "title": "Security vulnerabilities are identified and addressed",
          "description": "Security vulnerabilities are identified and addressed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "6.3.1",
              "title": "Security vulnerabilities identified and managed",
              "description": "Security vulnerabilities are identified and managed as follows: \r\n•\t New security vulnerabilities are identified using industry-recognized sources for security vulnerability information, including alerts from international and national computer emergency response teams (CERTs).\r\n•\t Vulnerabilities are assigned a risk ranking based on industry best practices and consideration of potential impact. \r\n•\t Risk rankings, at a minimum, identify all vulnerabilities considered to be a high-risk or critical to the environment. \r\n•\t Vulnerabilities for bespoke and custom, and third-party software (for example operating systems and databases) are covered.",
              "guidance": "This requirement is not achieved by, and is in addition to, performing vulnerability scans according to Requirements 11.3.1 and 11.3.2. This requirement is for a process to actively monitor industry sources for vulnerability information and for the entity to determine the risk ranking to be associated with each vulnerability.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.3.2",
              "title": "Inventory of bespoke software maintained",
              "description": "An inventory of bespoke and custom software, and third-party software components incorporated into bespoke and custom software is maintained to facilitate vulnerability and patch management.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.3.3",
              "title": "Critical security patches installed within one month",
              "description": "All system components are protected from known vulnerabilities by installing applicable security patches/updates as follows: \r\n•\t Patches/updates for critical vulnerabilities (identified according to the risk ranking process at Requirement 6.3.1) are installed within one month of release.\r\n•\t All other applicable security patches/updates are installed within an appropriate time frame as determined by the entity’s assessment of the criticality of the risk to the environment as identified according to the risk ranking process at Requirement 6.3.1",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "6.4",
          "title": "Public-facing web applications are protected against attacks",
          "description": "Public-facing web applications are protected against attacks.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "6.4.1",
              "title": "Public-facing web applications protected against attacks",
              "description": "For public-facing web applications, new threats and vulnerabilities are addressed on an ongoing basis and these applications are protected against known attacks as follows:\r\n•\t Reviewing public-facing web applications via manual or automated application vulnerability security assessment tools or methods as follows:\r\n•\t At least once every 12 months and after significant changes.\r\n•\t By an entity that specializes in application security.\r\n•\t Including, at a minimum, all common software attacks in Requirement 6.2.4.\r\n•\t All vulnerabilities are ranked in accordance with requirement 6.3.1.\r\n•\t All vulnerabilities are corrected.\r\n•\t The application is re-evaluated after the corrections.\r\nOR\r\n•\t Installing an automated technical solution(s) that continually detects and prevents web-based attacks as follows:\r\n•\t Installed in front of public-facing web applications to detect and prevent web-based attacks.\r\n•\t Actively running and up to date as applicable.\r\n•\t Generating audit logs. \r\n•\t Configured to either block web-based attacks or generate an alert that is immediately investigated.",
              "guidance": "This assessment is not the same as the vulnerability scans performed for Requirement 11.3.1 and 11.3.2.\r\nThis requirement will be superseded by Requirement 6.4.2 after 31 March 2025 when Requirement 6.4.2 becomes effective.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.4.2",
              "title": "Automated solution for web-based attacks deployed",
              "description": "For public-facing web applications, an automated technical solution is deployed that continually detects and prevents web-based attacks, with at least the following:\r\n•\t Is installed in front of public-facing web applications and is configured to detect and prevent web-based attacks.\r\n•\t Actively running and up to date as applicable. \r\n•\t Generating audit logs.\r\n•\t Configured to either block web-based attacks or generate an alert that is immediately investigated.",
              "guidance": "This new requirement will replace Requirement 6.4.1 once its effective date is reached.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.4.3",
              "title": "Payment page scripts managed",
              "description": "All payment page scripts that are loaded and executed in the consumer’s browser are managed as follows:\r\n•\t A method is implemented to confirm that each script is authorized.\r\n•\t A method is implemented to assure the integrity of each script. \r\n•\t An inventory of all scripts is maintained with written business or technical justification as to why each is necessary.",
              "guidance": "This requirement applies to all scripts loaded from the entity’s environment and scripts loaded from third and fourth parties. \r\nThis requirement also applies to scripts in the entity’s webpage(s) that includes a TPSP’s/payment processor’s embedded payment page/form (for example, one or more inline frames or iframes).\r\nThis requirement does not apply to an entity for scripts in a TPSP’s/payment processor’s embedded payment page/form (for example, one or more iframes), where the entity includes a TPSP’s/payment processor’s payment page/form on its webpage. \r\nScripts in the TPSP’s/payment processor’s embedded payment page/form are the responsibility of the TPSP/payment processor to manage in accordance with this requirement.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "6.5",
          "title": "Changes to all system components are managed securely",
          "description": "Changes to all system components are managed securely.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "6.5.1",
              "title": "Change control procedures implemented",
              "description": "Changes to all system components in the production environment are made according to established procedures that include: \r\n•\tReason for, and description of, the change. \r\n•\tDocumentation of security impact. \r\n•\tDocumented change approval by authorized parties.\r\n•\tTesting to verify that the change does not adversely impact system security.\r\n•\tFor bespoke and custom software changes, all updates are tested for compliance with Requirement 6.2.4 before being deployed into production. \r\n•\tProcedures to address failures and return to a secure state.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.5.2",
              "title": "Significant changes documented",
              "description": "Upon completion of a significant change, all applicable PCI DSS requirements are confirmed to be in place on all new or changed systems and networks, and documentation is updated as applicable.",
              "guidance": "These significant changes should also be captured and reflected in the entity’s annual PCI DSS scope confirmation activity per Requirement 12.5.2.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.5.3",
              "title": "Pre-production environments separated from production",
              "description": "Pre-production environments are separated from production environments and the separation is enforced with access controls.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.5.4",
              "title": "Separation of duties between environments",
              "description": "Roles and functions are separated between production and pre-production environments to provide accountability such that only reviewed and approved changes are deployed.",
              "guidance": "In environments with limited personnel where individuals perform multiple roles or functions, this same goal can be achieved with additional procedural controls that provide accountability. For example, a developer may also be an administrator that uses an administrator-level account with elevated privileges in the development environment and, for their developer role, they use a separate account with user-level access to the production environment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.5.5",
              "title": "Live PANs not used in pre-production",
              "description": "Live PANs are not used in pre-production environments, except where those environments are included in the CDE and protected in accordance with all applicable PCI DSS requirements.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "6.5.6",
              "title": "Test data removed before production",
              "description": "Test data and test accounts are removed from system components before the system goes into production.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 7",
      "title": "Restrict Access to System Components and Cardholder Data by Business Need to Know",
      "description": "Unauthorized individuals may gain access to critical data or systems due to ineffective access control rules and definitions.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "7.1",
          "title": "Processes and mechanisms for restricting access are defined and understood",
          "description": "Processes and mechanisms for restricting access to system components and cardholder data by business need to know are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "7.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 7 are:\r\n•\tDocumented, \r\n•\tKept up to date\r\n•\t In use \r\n•\tKnown to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 7 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "7.2",
          "title": "Access to system components and data is appropriately defined and assigned",
          "description": "Access to system components and data is appropriately defined and assigned.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "7.2.1",
              "title": "Access control model defined",
              "description": "An access control model is defined and includes granting access as follows:\r\n•\t Appropriate access depending on the entity’s business and access needs. \r\n•\t Access to system components and data resources that is based on users’ job classification and functions. \r\n•\t The least privileges required (for example, user, administrator) to perform a job function.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.2.2",
              "title": "Access assigned based on job classification",
              "description": "Access is assigned to users, including privileged users, based on: \r\n•\t Job classification and function.\r\n•\t Least privileges necessary to perform job responsibilities.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.2.3",
              "title": "Required privileges approved by authorized personnel",
              "description": "Required privileges are approved by authorized personnel.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.2.4",
              "title": "User accounts and access privileges reviewed at least every 6 months",
              "description": "All user accounts and related access privileges, including third-party/vendor accounts, are reviewed as follows:\r\n•\t At least once every six months\r\n•\t To ensure user accounts and access remain appropriate based on job function. \r\n•\t Any inappropriate access is addressed.\r\n•\t Management acknowledges that access remains appropriate.",
              "guidance": "This requirement applies to all user accounts and related access privileges, including those used by personnel and third parties/vendors, and accounts used to access third-party cloud services. \r\nSee Requirements 7.2.5 and 7.2.5.1 and 8.6.1 through 8.6.3 for controls for application and system accounts.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.2.5",
              "title": "Application and system accounts access privileges assigned based on least privilege",
              "description": "All application and system accounts and related access privileges are assigned and managed as follows:\r\n•\t Based on the least privileges necessary for the operability of the system or application.\r\n•\t Access is limited to the systems, applications, or processes that specifically require their use.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.2.5.1",
              "title": "Access reviewed periodically for application and system accounts",
              "description": "All access by application and system accounts and related access privileges are reviewed as follows:\r\n•\t Periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1).\r\n•\t The application/ system access remains appropriate for the function being performed. \r\n•\t Any inappropriate access is addressed.\r\n•\t Management acknowledges that access remains appropriate.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.2.6",
              "title": "User access to query repositories restricted",
              "description": "All user access to query repositories of stored cardholder data is restricted as follows:\r\n•\t Via applications or other programmatic methods, with access and allowed actions based on user roles and least privileges.\r\n•\t Only the responsible administrator(s) can directly access or query repositories of stored CHD.",
              "guidance": "This requirement applies to controls for user access to query repositories of stored cardholder data. \r\nSee Requirements 7.2.5 and 7.2.5.1 and 8.6.1 through 8.6.3 for controls for application and system accounts.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "7.3",
          "title": "Access to system components and data is managed via an access control system(s)",
          "description": "Logical access to system components and data is managed via an access control system(s).",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "7.3.1",
              "title": "Access control system(s) in place to restrict access",
              "description": "An access control system(s) is in place that restricts access based on a user’s need to know and covers all system components.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.3.2",
              "title": "Access control system(s) enforces permissions",
              "description": "The access control system(s) is configured to enforce privileges assigned to individuals, applications, and systems based on job classification and function.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "7.3.3",
              "title": "Access control system(s) set to deny all by default",
              "description": "The access control system(s) is set to “deny all” by default.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 8",
      "title": "Identify Users and Authenticate Access to System Components",
      "description": "Two fundamental principles of identifying and authenticating users are establishing the identity of an individual or process on a computer system, and proving or verifying the user associated with the identity.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "8.1",
          "title": "Processes and mechanisms for identifying and authenticating access are defined and understood",
          "description": "Processes and mechanisms to perform activities in Requirement 8 are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "8.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 8 are:\r\n•\t Documented.\r\n•\t Kept up to date.\r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 8 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "8.2",
          "title": "User identification and related accounts are strictly managed throughout an account's lifecycle",
          "description": "User identification and related accounts for users and administrators are strictly managed throughout an account’s lifecycle.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "8.2.1",
              "title": "Unique ID assigned to each user",
              "description": "All users are assigned a unique ID before access to system components or cardholder data is allowed.",
              "guidance": "This requirement is not intended to apply to user accounts within point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.2",
              "title": "Group, shared, or generic accounts managed exceptionally",
              "description": "Group, shared, or generic IDs, or other shared authentication credentials are only used when necessary on an exception basis, and are managed as follows:\r\n•\t ID use is prevented unless needed for an exceptional circumstance.\r\n•\t Use is limited to the time needed for the exceptional circumstance.\r\n•\t Business justification for use is documented.\r\n•\t Use is explicitly approved by management. \r\n•\t Individual user identity is confirmed before access to an account is granted.\r\n•\t Every action taken is attributable to an individual user.",
              "guidance": "This requirement is not intended to apply to user accounts within point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.3",
              "title": "Additional requirement for service providers with remote access",
              "description": "Additional requirement for service providers only: Service providers with remote access to customer premises use unique authentication factors for each customer premises.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement is not intended to apply to service providers accessing their own shared services environments, where multiple customer environments are hosted.\r\nIf service provider employees use shared authentication factors to remotely access customer premises, these factors must be unique per customer and managed in accordance with Requirement 8.2.2.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.4",
              "title": "Addition, deletion, and modification of user IDs managed",
              "description": "Addition, deletion, and modification of user IDs, authentication factors, and other identifier objects are managed as follows:\r\n•\t Authorized with the appropriate approval.\r\n•\t Implemented with only the privileges specified on the documented approval.",
              "guidance": "This requirement applies to all user accounts, including employees, contractors, consultants, temporary workers and third-party vendors.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.5",
              "title": "Access for terminated users immediately revoked",
              "description": "Access for terminated users is immediately revoked",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.6",
              "title": "Inactive user accounts removed or disabled",
              "description": "Inactive user accounts are removed or disabled within 90 days of inactivity.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.7",
              "title": "Third-party vendor accounts managed",
              "description": "Accounts used by third parties to access, support, or maintain system components via remote access are managed as follows:\r\n•\t Enabled only during the time period needed and disabled when not in use.\r\n•\t Use is monitored for unexpected activity.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.2.8",
              "title": "User sessions terminated after 15 minutes of inactivity",
              "description": "If a user session has been idle for more than 15 minutes, the user is required to re-authenticate to re-activate the terminal or session.",
              "guidance": "This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.\r\nThis requirement is not meant to prevent legitimate activities from being performed while the console/PC is unattended.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "8.3",
          "title": "Strong authentication for users and administrators is established and managed",
          "description": "Strong authentication for users and administrators is established and managed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "8.3.1",
              "title": "All user access authenticated with at least one factor",
              "description": "All user access to system components for users and administrators is authenticated via at least one of the following authentication factors:\r\n•\tSomething you know, such as a password or passphrase.\r\n•\tSomething you have, such as a token device or smart card.\r\n•\tSomething you are, such as a biometric element.",
              "guidance": "This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.\r\nThis requirement does not supersede multi-factor authentication (MFA) requirements but applies to those in-scope systems not otherwise subject to MFA requirements.\r\nA digital certificate is a valid option for “something you have” if it is unique for a particular user.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.2",
              "title": "Strong cryptography used to render authentication factors unreadable",
              "description": "Strong cryptography is used to render all authentication factors unreadable during transmission and storage on all system components.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.3",
              "title": "User identity verified before modifying authentication factors",
              "description": "User identity is verified before modifying any authentication factor.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.4",
              "title": "Invalid authentication attempts limited",
              "description": "Invalid authentication attempts are limited by: \r\n•\t Locking out the user ID after not more than 10 attempts.\r\n•\t Setting the lockout duration to a minimum of 30 minutes or until the user’s identity is confirmed.",
              "guidance": "This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.5",
              "title": "Lockout duration at least 30 minutes or until administrator enables",
              "description": "If passwords/passphrases are used as authentication factors to meet Requirement 8.3.1, they are set and reset for each user as follows: \r\n•\t Set to a unique value for first-time use and upon reset.\r\n•\t Forced to be changed immediately after the first use.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.6",
              "title": "Passwords/passphrases meet minimum length and complexity",
              "description": "If passwords/passphrases are used as authentication factors to meet Requirement 8.3.1, they meet the following minimum level of complexity: \r\n•\t A minimum length of 12 characters (or IF the system does not support 12 characters, a minimum length of eight characters).\r\n•\t Contain both numeric and alphabetic characters.",
              "guidance": "This requirement is not intended to apply to: \r\n•\t User accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.\r\n•\t Application or system accounts, which are governed by requirements in section 8.6.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.\r\nUntil 31 March 2025, passwords must be a minimum length of seven characters in accordance with PCI DSS v3.2.1 Requirement 8.2.3.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.7",
              "title": "Users not allowed to submit same password as previous four",
              "description": "Individuals are not allowed to submit a new password/passphrase that is the same as any of the last four passwords/passphrases used.",
              "guidance": "This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.8",
              "title": "Authentication policies and procedures documented",
              "description": "Authentication policies and procedures are documented and communicated to all users including: \r\n•\t Guidance on selecting strong authentication factors.\r\n•\tGuidance for how users should protect their authentication factors.\r\n•\tInstructions not to reuse previously used passwords/passphrases.\r\n•\tInstructions to change passwords/passphrases if there is any suspicion or knowledge that the password/passphrases have been compromised and how to report the incident.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.9",
              "title": "Passwords/passphrases changed at least once every 90 days",
              "description": "If passwords/passphrases are used as the only authentication factor for user access (i.e., in any single-factor authentication implementation) then either:\r\n•\t Passwords/passphrases are changed at least once every 90 days, \r\nOR\r\n•\t The security posture of accounts is dynamically analyzed, and real-time access to resources is automatically determined accordingly.",
              "guidance": "This requirement does not apply to in-scope system components where MFA is used.\r\nThis requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.\r\nThis requirement does not apply to service providers’ customer accounts but does apply to accounts for service provider personnel.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.10",
              "title": "Additional requirement for service providers using passwords",
              "description": "Additional requirement for service providers only: If passwords/passphrases are used as the only authentication factor for customer user access to cardholder data (i.e., in any single-factor authentication implementation), then guidance is provided to customer users including:\r\n•\tGuidance for customers to change their user passwords/passphrases periodically.\r\n•\tGuidance as to when, and under what circumstances, passwords/passphrases are to be changed.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement does not apply to accounts of consumer users accessing their own payment card information.\r\nThis requirement for service providers will be superseded by Requirement 8.3.10.1 once 8.3.10.1 becomes effective.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.10.1",
              "title": "Additional requirement for service providers for customer passwords",
              "description": "Additional requirement for service providers only: If passwords/passphrases are used as the only authentication factor for customer user access (i.e., in any single-factor authentication implementation) then either:\r\n•\t Passwords/passphrases are changed at least once every 90 days, \r\nOR\r\n•\t The security posture of accounts is dynamically analyzed, and real-time access to resources is automatically determined accordingly.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement does not apply to accounts of consumer users accessing their own payment card information.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.\r\nUntil this requirement is effective on 31 March 2025, service providers may meet either Requirement 8.3.10 or 8.3.10.1.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.3.11",
              "title": "Physical and/or logical tokens can be used only once",
              "description": "Where authentication factors such as physical or logical security tokens, smart cards, or certificates are used: \r\n•\t Factors are assigned to an individual user and not shared among multiple users. \r\n•\t Physical and/or logical controls ensure only the intended user can use that factor to gain access.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "8.4",
          "title": "Multi-factor authentication (MFA) is implemented to secure access into the CDE",
          "description": "Multi-factor authentication (MFA) systems are configured to prevent misuse.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "8.4.1",
              "title": "MFA implemented for all non-console access into CDE",
              "description": "MFA is implemented for all non-console access into the CDE for personnel with administrative access.",
              "guidance": "The requirement for MFA for non-console administrative access applies to all personnel with elevated or increased privileges accessing the CDE via a non-console connection—that is, via logical access occurring over a network interface rather than via a direct, physical connection.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.4.2",
              "title": "MFA implemented for all access into CDE",
              "description": "MFA is implemented for all non-console access into the CDE.",
              "guidance": "This requirement does not apply to: \r\n•\t Application or system accounts performing automated functions.\r\n•\t User accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction.\r\n•\t User accounts that are only authenticated with phishing-resistant authentication factors.\r\nMFA is required for both types of access specified in Requirements 8.4.2 and 8.4.3. Therefore, applying MFA to one type of access does not replace the need to apply another instance of MFA to the other type of access. If an individual first connects to the entity’s network via remote access, and then later initiates a connection into the CDE from within the network, per this requirement the individual would authenticate using MFA twice, once when connecting via remote access to the entity’s network and once when connecting from the entity’s network into the CDE.\r\nThe MFA requirements apply for all types of system components, including cloud, hosted systems, and on-premises applications, network security devices, workstations, servers, and endpoints, and includes access directly to an entity’s networks or systems as well as web-based access to an application or function. \r\nMFA for access into the CDE can be implemented at the network or system/application level; it does not have to be applied at both levels. For example, if MFA is used when a user connects to the CDE network, it does not have to be used when the user logs into each system or application within the CDE.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.4.3",
              "title": "MFA implemented for remote network access",
              "description": "MFA is implemented for all remote network access originating from outside the entity’s network that could access or impact the CDE.",
              "guidance": "The requirement for MFA for remote access originating from outside the entity’s network applies to all user accounts that can access the network remotely, where that remote access leads to or could lead to access into the CDE. This includes all remote access by personnel (users and administrators), and third parties (including, but not limited to, vendors, suppliers, service providers, and customers).\r\nIf remote access is to a part of the entity’s network that is properly segmented from the CDE, such that remote users cannot access or impact the CDE, MFA for remote access to that part of the network is not required. However, MFA is required for any remote access to networks with access to the CDE and is recommended for all remote access to the entity’s networks.\r\nThe MFA requirements apply for all types of system components, including cloud, hosted systems, and on-premises applications, network security devices, workstations, servers, and endpoints, and includes access directly to an entity’s networks or systems as well as web-based access to an application or function.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "8.5",
          "title": "Multi-factor authentication (MFA) systems are configured to prevent misuse",
          "description": "Multi-factor authentication is implemented to secure access to the CDE.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "8.5.1",
              "title": "MFA systems implemented appropriately",
              "description": "MFA systems are implemented as follows:\r\n•\tThe MFA system is not susceptible to replay attacks.\r\n•\tMFA systems cannot be bypassed by any users, including administrative users unless specifically documented, and authorized by management on an exception basis, for a limited time period. \r\n•\tAt least two different types of authentication factors are used.\r\n•\tSuccess of all authentication factors is required before access is granted.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "8.6",
          "title": "Use of application and system accounts is strictly managed",
          "description": "Use of application and system accounts and associated authentication factors are strictly managed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "8.6.1",
              "title": "System or application accounts managed appropriately",
              "description": "If accounts used by systems or applications can be used for interactive login, they are managed as follows: \r\n•\t Interactive use is prevented unless needed for an exceptional circumstance.\r\n•\t Interactive use is limited to the time needed for the exceptional circumstance.\r\n•\t Business justification for interactive use is documented.\r\n•\t Interactive use is explicitly approved by management. \r\n•\t Individual user identity is confirmed before access to account is granted.\r\n•\t Every action taken is attributable to an individual user.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.6.2",
              "title": "Passwords/passphrases for system accounts not hard-coded",
              "description": "Passwords/passphrases for any application and system accounts that can be used for interactive login are not hard coded in scripts, configuration/property files, or bespoke and custom source code. Note: stored passwords/ passphrases are required to be encrypted in accordance with PCI DSS Requirement 8.3.2.",
              "guidance": "Stored passwords/passphrases are required to be encrypted in accordance with PCI DSS Requirement 8.3.2.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "8.6.3",
              "title": "Passwords/passphrases for system accounts protected",
              "description": "Passwords/passphrases for any application and system accounts are protected against misuse as follows: \r\n•\t Passwords/passphrases are changed periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1) and upon suspicion or confirmation of compromise.\r\n•\t Passwords/passphrases are constructed with sufficient complexity appropriate for how frequently the entity changes the passwords/passphrases.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 9",
      "title": "Restrict Physical Access to Cardholder Data",
      "description": "Any physical access to cardholder data or systems that store, process, or transmit cardholder data provides the opportunity for individuals to access and/or remove systems or hardcopies containing cardholder data.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "9.1",
          "title": "Processes and mechanisms for restricting physical access are defined and understood",
          "description": "Processes and mechanisms for performing activities in Requirement 9 are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "9.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 9 are:\r\n•\t Documented. \r\n•\t Kept up to date. \r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 9 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "9.2",
          "title": "Physical access controls manage entry into facilities and systems containing cardholder data",
          "description": "Physical access controls manage entry into the cardholder data environment.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "9.2.1",
              "title": "Entry controls limit and monitor physical access to CDE",
              "description": "Appropriate facility entry controls are in place to restrict physical access to systems in the CDE.",
              "guidance": "This requirement does not apply to locations that are publicly accessible by consumers (cardholders).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.2.1.1",
              "title": "Individual physical access to sensitive areas monitored",
              "description": "Individual physical access to sensitive areas within the CDE is monitored with either video cameras or physical access control mechanisms (or both) as follows:\r\n•\t Entry and exit points to/from sensitive areas within the CDE are monitored. \r\n•\t Monitoring devices or mechanisms are protected from tampering or disabling.\r\n•\t Collected data is reviewed and correlated with other entries.\r\n•\t Collected data is stored for at least three months, unless otherwise restricted by law.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.2.2",
              "title": "Physical and/or logical controls restrict use of publicly accessible network jacks",
              "description": "Physical and/or logical controls are implemented to restrict use of publicly accessible network jacks within the facility.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.2.3",
              "title": "Physical access to wireless access points and network gear restricted",
              "description": "Physical access to wireless access points, gateways, networking/communications hardware, and telecommunication lines within the facility is restricted.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.2.4",
              "title": "Consoles in sensitive areas secured when not in use",
              "description": "Access to consoles in sensitive areas is restricted via locking when not in use.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "9.3",
          "title": "Physical access for personnel and visitors is authorized and managed",
          "description": "Physical access to the cardholder data environment for personnel and visitors is authorized and managed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "9.3.1",
              "title": "Procedures for authorizing and managing physical access implemented",
              "description": "Procedures are implemented for authorizing and managing physical access of personnel to the CDE, including:\r\n•\t  Identifying personnel.\r\n•\t Managing changes to an individual’s physical access requirements.\r\n•\t  Revoking or terminating personnel identification.\r\n•\t  Limiting access to the identification process or system to authorized personnel.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.3.1.1",
              "title": "Physical access to sensitive areas controlled for personnel",
              "description": "Physical access to sensitive areas within the CDE for personnel is controlled as follows:\r\n•\t Access is authorized and based on individual job function.\r\n•\t Access is revoked immediately upon termination.\r\n•\t All physical access mechanisms, such as keys, access cards, etc., are returned or disabled upon termination.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.3.2",
              "title": "Procedures for managing visitor access implemented",
              "description": "Procedures are implemented for authorizing and managing visitor access to the CDE, including:\r\n•\t Visitors are authorized before entering.\r\n•\t Visitors are escorted at all times.\r\n•\t Visitors are clearly identified and given a badge or other identification that expires.\r\n•\t Visitor badges or other identification visibly distinguishes visitors from  personnel.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.3.3",
              "title": "Visitor badges or identification surrendered",
              "description": "Visitor badges or identification are surrendered or deactivated before visitors leave the facility or at the date of expiration.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.3.4",
              "title": "Visitor log maintained",
              "description": "Visitor logs are used to maintain a physical record of visitor activity both within the facility and within sensitive areas, including: \r\n•\t The visitor’s name and the organization represented.\r\n•\t The date and time of the visit.\r\n•\t The name of the personnel authorizing physical access. \r\n•\t Retaining the log for at least three months, unless otherwise restricted by law.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "9.4",
          "title": "Media with cardholder data is securely stored, accessed, distributed, and destroyed",
          "description": "Media with cardholder data is securely stored, accessed, distributed, and destroyed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "9.4.1",
              "title": "All media with cardholder data physically secured",
              "description": "All media with cardholder data is physically secured.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.1.1",
              "title": "Offline media backups stored in secure location",
              "description": "Offline media backups with cardholder data are stored in a secure location.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.1.2",
              "title": "Security of offline media backup locations reviewed at least annually",
              "description": "The security of the offline media backup location(s) with cardholder data is reviewed at least once every 12 months.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.2",
              "title": "All media with cardholder data classified",
              "description": "All media with cardholder data is classified in accordance with the sensitivity of the data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.3",
              "title": "Media with cardholder data sent via secured courier",
              "description": "Media with cardholder data sent outside the facility is secured as follows:\r\n• Media sent outside the facility is logged.\r\n• Media is sent by secured courier or other delivery method that can be accurately tracked.\r\n• Offsite tracking logs include details about media location.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.4",
              "title": "Management approves all media moves",
              "description": "Management approves all media with cardholder data that is moved outside the facility (including when media is distributed to individuals).",
              "guidance": "Individuals approving media movements should have the appropriate level of management authority to grant this approval. However, it is not specifically required that such individuals have “manager” as part of their title.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.5",
              "title": "Inventory logs of all electronic media with cardholder data maintained",
              "description": "Inventory logs of all electronic media with cardholder data are maintained.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.5.1",
              "title": "Inventories of electronic media with cardholder data conducted at least annually",
              "description": "Inventories of electronic media with cardholder data are conducted at least once every 12 months.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.6",
              "title": "Hard-copy materials with cardholder data destroyed",
              "description": "Hard-copy materials with cardholder data are destroyed when no longer needed for business or legal reasons, as follows:\r\n•\t Materials are cross-cut shredded, incinerated, or pulped so that cardholder data cannot be reconstructed. \r\n•\t Materials are stored in secure storage containers prior to destruction.",
              "guidance": "These requirements for media destruction when that media is no longer needed for business or legal reasons are separate and distinct from PCI DSS Requirement 3.2.1, which is for securely deleting cardholder data when no longer needed per the entity’s cardholder data retention policies.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.4.7",
              "title": "Electronic media with cardholder data destroyed",
              "description": "Electronic media with cardholder data is destroyed when no longer needed for business or legal reasons via one of the following: \r\n•\t The electronic media is destroyed.\r\n•\t The cardholder data is rendered unrecoverable so that it cannot be reconstructed.",
              "guidance": "These requirements for media destruction when that media is no longer needed for business or legal reasons are separate and distinct from PCI DSS Requirement 3.2.1, which is for securely deleting cardholder data when no longer needed per the entity’s cardholder data retention policies.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "9.5",
          "title": "Point of interaction (POI) devices are protected from tampering and unauthorized substitution",
          "description": "Point-of-interaction (POI) devices are protected from tampering and unauthorized substitution.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "9.5.1",
              "title": "POI devices protected from tampering and substitution",
              "description": "POI devices that capture payment card data via direct physical interaction with the payment card form factor are protected from tampering and unauthorized substitution, including the following:\r\n•\t Maintaining a list of POI devices. \r\n•\t Periodically inspecting POI devices to look for tampering or unauthorized substitution. \r\n•\t Training personnel to be aware of suspicious behavior and to report tampering or unauthorized substitution of devices.",
              "guidance": "These requirements apply to deployed POI devices used in card-present transactions (that is, a payment card form factor such as a card that is swiped, tapped, or dipped). These requirements do not apply to:\r\n•\t Components used only for manual PAN key entry.\r\n•\t Commercial off-the-shelf (COTS) devices (for example, smartphones or tablets), which are mobile merchant-owned devices designed for mass-market distribution.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.5.1.1",
              "title": "Up-to-date list of POI devices maintained",
              "description": "An up-to-date list of POI devices is maintained, including:\r\n•\t Make and model of the device. \r\n•\t Location of device. \r\n•\t Device serial number or other methods of unique identification.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.5.1.2",
              "title": "POI device surfaces periodically inspected",
              "description": "POI device surfaces are periodically inspected to detect tampering and unauthorized substitution.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.5.1.2.1",
              "title": "Frequency of POI device inspections defined in risk analysis",
              "description": "The frequency of periodic POI device inspections and the type of inspections performed is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "9.5.1.3",
              "title": "Training provided to personnel for POI device awareness",
              "description": "Training is provided for personnel in POI environments to be aware of attempted tampering or replacement of POI devices, and includes:\r\n•\t Verifying the identity of any third-party persons claiming to be repair or maintenance personnel, before granting them access to modify or troubleshoot devices.\r\n•\t Procedures to ensure devices are not installed, replaced, or returned without verification. \r\n•\t Being aware of suspicious behavior around devices.\r\n•\t Reporting suspicious behavior and indications of device tampering or substitution to appropriate personnel.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 10",
      "title": "Log and Monitor All Access to System Components and Cardholder Data",
      "description": "Logging mechanisms and the ability to track user activities are critical in preventing, detecting, or minimizing the impact of a data compromise.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "10.1",
          "title": "Processes and mechanisms for logging and monitoring are defined and understood",
          "description": "Processes and mechanisms for performing activities in Requirement 10 are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 10 are: \r\n•\t Documented.\r\n•\t Kept up to date.\r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 10 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "10.2",
          "title": "Audit logs are implemented to support the detection of anomalies",
          "description": "Audit logs are implemented to support the detection of anomalies and suspicious activity, and the forensic analysis of events.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.2.1",
              "title": "Audit logs enabled and active for all system components",
              "description": "Audit logs are enabled and active for all system components and cardholder data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.1",
              "title": "Audit logs capture all individual user access to cardholder data",
              "description": "Audit logs capture all individual user access to cardholder data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.2",
              "title": "Audit logs capture all actions taken with administrative privileges",
              "description": "Audit logs capture all actions taken by any individual with administrative access, including any interactive use of application or system accounts.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.3",
              "title": "Audit logs capture all access to audit logs",
              "description": "Audit logs capture all access to audit logs.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.4",
              "title": "Audit logs capture all invalid logical access attempts",
              "description": "Audit logs capture all invalid logical access attempts.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.5",
              "title": "Audit logs capture all changes to identification and authentication credentials",
              "description": "Audit logs capture all changes to identification and authentication credentials including, but not limited to:\r\n•\t Creation of new accounts.\r\n•\t Elevation of privileges.\r\n•\t All changes, additions, or deletions to accounts with administrative access.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.6",
              "title": "Audit logs capture initialization, stopping, or pausing of logs",
              "description": "Audit logs capture the following: \r\n•\t All initialization of new audit logs, and \r\n•\t All starting, stopping, or pausing of the existing audit logs.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.1.7",
              "title": "Audit logs capture creation and deletion of system-level objects",
              "description": "Audit logs capture all creation and deletion of system-level objects.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.2.2",
              "title": "Audit logs record required information for each auditable event",
              "description": "Audit logs record the following details for each auditable event:\r\n•\t User identification.\r\n•\t Type of event.\r\n•\t Date and time.\r\n•\t Success and failure indication.\r\n•\t Origination of event.\r\n•\t Identity or name of affected data, system component, resource, or service (for example, name and protocol).",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "10.3",
          "title": "Audit logs are protected from destruction and unauthorized modifications",
          "description": "Audit logs are protected from destruction and unauthorized modifications.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.3.1",
              "title": "Read access to audit logs limited to those with job-related need",
              "description": "Read access to audit logs files is limited to those with a job-related need.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.3.2",
              "title": "Audit log files protected from unauthorized modifications",
              "description": "Audit log files are protected to prevent modifications by individuals.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.3.3",
              "title": "Audit log files promptly backed up to secure central log server",
              "description": "Audit log files, including those for external-facing technologies, are promptly backed up to a secure, central, internal log server(s) or other media that is difficult to modify.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.3.4",
              "title": "File integrity monitoring on audit logs",
              "description": "File integrity monitoring or change-detection mechanisms is used on audit logs to ensure that existing log data cannot be changed without generating alerts.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "10.4",
          "title": "Audit logs are reviewed to identify anomalies or suspicious activity",
          "description": "Audit logs are reviewed to identify anomalies or suspicious activity.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.4.1",
              "title": "Audit logs reviewed at least daily",
              "description": "The following audit logs are reviewed at least once daily:\r\n•\t All security events. \r\n•\t Logs of all system components that store, process, or transmit CHD and/or SAD.\r\n•\t Logs of all critical system components.\r\n•\t Logs of all servers and system components that perform security functions (for example, network security controls, intrusion-detection systems/intrusion-prevention systems (IDS/IPS), authentication servers).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.4.1.1",
              "title": "Automated mechanisms used to perform audit log reviews",
              "description": "Automated mechanisms are used to perform audit log reviews.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.4.2",
              "title": "Logs of other system components reviewed periodically",
              "description": "Logs of all other system components (those not specified in Requirement 10.4.1) are reviewed periodically.",
              "guidance": "This requirement is applicable to all other in-scope system components not included in Requirement 10.4.1.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.4.2.1",
              "title": "Frequency of periodic log reviews defined in risk analysis",
              "description": "The frequency of periodic log reviews for all other system components (not defined in Requirement 10.4.1) is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.4.3",
              "title": "Exceptions and anomalies identified during review are addressed",
              "description": "Exceptions and anomalies identified during the review process are addressed.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "10.5",
          "title": "Audit log history is retained and available for analysis",
          "description": "Audit log history is retained and available for analysis.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.5.1",
              "title": "Audit log history retained for at least 12 months",
              "description": "Retain audit log history for at least 12 months, with at least the most recent three months immediately available for analysis.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "10.6",
          "title": "Time-synchronization mechanisms support consistent time across all systems",
          "description": "Time-synchronization mechanisms support consistent time settings across all systems.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.6.1",
              "title": "System clocks and time synchronized",
              "description": "System clocks and time are synchronized using time-synchronization technology.",
              "guidance": "Keeping time-synchronization technology current includes managing vulnerabilities and patching the technology according to PCI DSS Requirements 6.3.1 and 6.3.3.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.6.2",
              "title": "Time data protected from unauthorized access",
              "description": "Systems are configured to the correct and consistent time as follows:\r\n•\t One or more designated time servers are in use.\r\n•\t Only the designated central time server(s) receives time from external sources.\r\n•\t Time received from external sources is based on International Atomic Time or Coordinated Universal Time (UTC).\r\n•\t The designated time server(s) accept time updates only from specific industry-accepted external sources.\r\n•\t Where there is more than one designated time server, the time servers peer with one another to keep accurate time.\r\n•\t Internal systems receive time information only from designated central time server(s).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.6.3",
              "title": "Time settings received from industry-accepted time sources",
              "description": "Time synchronization settings and data are protected as follows: \r\n•\t Access to time data is restricted to only personnel with a business need.\r\n•\t Any changes to time settings on critical systems are logged, monitored, and reviewed.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "10.7",
          "title": "Failures of critical security control systems are detected and addressed",
          "description": "Failures of critical security control systems are detected, reported, and responded to promptly.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "10.7.1",
              "title": "Additional requirement for service providers for prompt detection of failures",
              "description": "Additional requirement for service providers only: Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of the following critical security control systems:\r\n•\t Network security controls \r\n•\t IDS/IPS \r\n•\t FIM \r\n•\t Anti-malware solutions \r\n•\t Physical access controls \r\n•\t Logical access controls \r\n•\t Audit logging mechanisms \r\n•\t Segmentation controls (if used)",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement will be superseded by Requirement 10.7.2 as of 31 March 2025.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.7.2",
              "title": "Failures of critical security control systems detected and addressed promptly",
              "description": "Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of the following critical security control systems:\r\n•\t Network security controls.\r\n•\t IDS/IPS.\r\n•\t Change-detection mechanisms.\r\n•\t Anti-malware solutions.\r\n•\t Physical access controls.\r\n•\t Logical access controls.\r\n•\t Audit logging mechanisms.\r\n•\t Segmentation controls (if used).\r\n•\t Audit log review mechanisms.\r\n•\t Automated security testing tools (if used).",
              "guidance": "This requirement applies to all entities, including service providers, and will supersede Requirement 10.7.1 as of 31 March 2025. It includes two additional critical security control systems not in Requirement 10.7.1. \r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "10.7.3",
              "title": "Failures of security control systems responded to promptly",
              "description": "Failures of any critical security control systems are responded to promptly, including but not limited to: \r\n•\t Restoring security functions. \r\n•\t Identifying and documenting the duration (date and time from start to end) of the security failure. \r\n•\t Identifying and documenting the cause(s) of failure, and documenting required remediation. \r\n•\t Identifying and addressing any security issues that arose during the failure. \r\n•\t Determining whether further actions are required as a result of the security failure. \r\n•\t Implementing controls to prevent the cause of failure from reoccurring. \r\n•\t Resuming monitoring of security controls.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider, until the 31 March 2025, after which this requirement will apply to all entities.\r\nThis is a current v3.2.1 requirement that applies to service providers only. However, this requirement is a best practice for all other entities until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 11",
      "title": "Test Security of Systems and Networks Regularly",
      "description": "Vulnerabilities are being discovered continually by malicious individuals and researchers, and being introduced by new software.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "11.1",
          "title": "Processes and mechanisms for testing security are defined and understood",
          "description": "Processes and mechanisms for performing activities in Requirement 11 are defined and understood.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "11.1.1",
              "title": "Security policies and operational procedures documented",
              "description": "All security policies and operational procedures that are identified in Requirement 11 are: \r\n•\t Documented. \r\n•\t Kept up to date.\r\n•\t In use.\r\n•\t Known to all affected parties.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.1.2",
              "title": "Roles and responsibilities documented and assigned",
              "description": "Roles and responsibilities for performing activities in Requirement 11 are documented, assigned, and understood.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "11.2",
          "title": "Wireless access points are identified and monitored",
          "description": "Wireless access points are identified and monitored, and unauthorized wireless access points are addressed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "11.2.1",
              "title": "Authorized and unauthorized wireless access points managed",
              "description": "Authorized and unauthorized wireless access points are managed as follows:\r\n•\t The presence of wireless (Wi-Fi) access points is tested for, \r\n•\t All authorized and unauthorized wireless access points are detected and identified, \r\n•\t Testing, detection, and identification occurs at least once every three months. \r\n•\t If automated monitoring is used, personnel are notified via generated alerts.",
              "guidance": "The requirement applies even when a policy exists that prohibits the use of wireless technology.\r\nMethods used to meet this requirement must be sufficient to detect and identify both authorized and unauthorized devices, including unauthorized devices attached to devices that themselves are authorized.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.2.2",
              "title": "Inventory of authorized wireless access points maintained",
              "description": "An inventory of authorized wireless access points is maintained, including a documented business justification.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "11.3",
          "title": "External and internal vulnerabilities are regularly identified and addressed",
          "description": "External and internal vulnerabilities are regularly identified, prioritized, and addressed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "11.3.1",
              "title": "Internal vulnerability scans performed at least quarterly",
              "description": "Internal vulnerability scans are performed as follows: \r\n•\t At least once every three months.\r\n•\t Vulnerabilities that are either high-risk or critical (according to the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are resolved.\r\n•\t Rescans are performed that confirm all high-risk and all critical vulnerabilities (as noted above) have been resolved.\r\n•\t Scan tool is kept up to date with latest vulnerability information.\r\n•\t Scans are performed by qualified personnel and organizational independence of the tester exists.",
              "guidance": "It is not required to use a QSA or ASV to conduct internal vulnerability scans.\r\nInternal vulnerability scans can be performed by qualified, internal staff that are reasonably independent of the system component(s) being scanned (for example, a network administrator should not be responsible for scanning the network), or an entity may choose to have internal vulnerability scans performed by a firm specializing in vulnerability scanning.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.3.1.1",
              "title": "All other vulnerabilities managed based on risk",
              "description": "All other applicable vulnerabilities (those not ranked as high-risk vulnerabilities or critical vulnerabilities according to the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are managed as follows:\r\n•\t Addressed based on the risk defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1.\r\n•\t Rescans are conducted as needed.",
              "guidance": "The timeframe for addressing lower-risk vulnerabilities is subject to the results of a risk analysis per Requirement 12.3.1 that includes (minimally) identification of assets being protected, threats, and likelihood and/or impact of a threat being realized.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.3.1.2",
              "title": "Internal vulnerability scans performed via authenticated scanning",
              "description": "Internal vulnerability scans are performed via authenticated scanning as follows:\r\n•\t Systems that are unable to accept credentials for authenticated scanning are documented.\r\n•\t Sufficient privileges are used, for those systems that accept credentials for scanning. \r\n•\t If accounts used for authenticated scanning can be used for interactive login, they are managed in accordance with Requirement 8.2.2.",
              "guidance": "The authenticated scanning tools can be either host-based or network-based. \r\n“Sufficient” privileges are those needed to access system resources such that a thorough scan can be conducted that detects known vulnerabilities. \r\nThis requirement does not apply to system components that cannot accept credentials for scanning. Examples of systems that may not accept credentials for scanning include some network and security appliances, mainframes, and containers.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.3.1.3",
              "title": "Internal scans performed after significant changes",
              "description": "Internal vulnerability scans are performed after any significant change as follows:\r\n•\t Vulnerabilities that are either high-risk or critical (according to the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are resolved.\r\n•\t Rescans are conducted as needed.\r\n•\t Scans are performed by qualified personnel and organizational independence of the tester exists (not required to be a QSA or ASV).",
              "guidance": "Authenticated internal vulnerability scanning per Requirement 11.3.1.2 is not required for scans performed after significant changes.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.3.2",
              "title": "External vulnerability scans performed at least quarterly",
              "description": "External vulnerability scans are performed as follows:\r\n•\t At least once every three months.\r\n•\t By a PCI SSC Approved Scanning Vendor (ASV). \r\n•\t Vulnerabilities are resolved and ASV Program Guide requirements for a passing scan are met.\r\n•\t Rescans are performed as needed to confirm that vulnerabilities are resolved per the ASV Program Guide requirements for a passing scan.",
              "guidance": "For the initial PCI DSS assessment against this requirement, it is not required that four passing scans be completed within 12 months if the assessor verifies: 1) the most recent scan result was a passing scan, 2) the entity has documented policies and procedures requiring scanning at least once every three months, and 3) vulnerabilities noted in the scan results have been corrected as shown in a re-scan(s). \r\nHowever, for subsequent years after the initial PCI DSS assessment, passing scans at least every three months must have occurred.\r\nASV scanning tools can scan a vast array of network types and topologies. Any specifics about the target environment (for example, load balancers, third-party providers, ISPs, specific configurations, protocols in use, scan interference) should be worked out between the ASV and scan customer.\r\nRefer to the ASV Program Guide published on the PCI SSC website for scan customer responsibilities, scan preparation, etc.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.3.2.1",
              "title": "External scans performed after significant changes",
              "description": "External vulnerability scans are performed after any significant change as follows:\r\n•\t Vulnerabilities that are scored 4.0 or higher by the CVSS are resolved.\r\n•\t Rescans are conducted as needed.\r\n•\t Scans are performed by qualified personnel and organizational independence of the tester exists (not required to be a QSA or ASV).",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "11.4",
          "title": "External and internal penetration testing is regularly performed",
          "description": "External and internal penetration testing is regularly performed, and exploitable vulnerabilities and security weaknesses are corrected.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "11.4.1",
              "title": "Penetration testing methodology defined and documented",
              "description": "A penetration testing methodology is defined, documented, and implemented by the entity, and includes: \r\n•\t Industry-accepted penetration testing approaches.\r\n•\t Coverage for the entire CDE perimeter and critical systems. \r\n•\t Testing from both inside and outside the network. \r\n•\t Testing to validate any segmentation and scope-reduction controls. \r\n•\t Application-layer penetration testing to identify, at a minimum, the vulnerabilities listed in Requirement 6.2.4. \r\n•\t Network-layer penetration tests that encompass all components that support network functions as well as operating systems. \r\n•\t Review and consideration of threats and vulnerabilities experienced in the last 12 months. \r\n•\t Documented approach to assessing and addressing the risk posed by exploitable vulnerabilities and security weaknesses found during penetration testing. \r\n•\t Retention of penetration testing results and remediation activities results for at least 12 months.",
              "guidance": "Testing from inside the network (or “internal penetration testing”) means testing from both inside the CDE and into the CDE from trusted and untrusted internal networks. \r\nTesting from outside the network (or “external” penetration testing” means testing the exposed external perimeter of trusted networks, and critical systems connected to or accessible to public network infrastructures.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.4.2",
              "title": "Internal penetration testing performed at least annually",
              "description": "Internal penetration testing is performed:\r\n•\t Per the entity’s defined methodology \r\n•\t At least once every 12 months \r\n•\t After any significant infrastructure or application upgrade or change\r\n•\t By a qualified internal resource or qualified external third-party\r\n•\t Organizational independence of the tester exists (not required to be a QSA or ASV).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.4.3",
              "title": "External penetration testing performed at least annually",
              "description": "External penetration testing is performed: \r\n•\t Per the entity’s defined methodology \r\n•\t At least once every 12 months \r\n•\t After any significant infrastructure or application upgrade or change\r\n•\t By a qualified internal resource or qualified external third party\r\n•\t Organizational independence of the tester exists (not required to be a QSA or ASV).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.4.4",
              "title": "Exploitable vulnerabilities corrected and testing repeated",
              "description": "Exploitable vulnerabilities and security weaknesses found during penetration testing are corrected as follows:\r\n•\t In accordance with the entity’s assessment of the risk posed by the security issue as defined in Require ment 6.3.1.\r\n•\t Penetration testing is repeated to verify the corrections.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.4.5",
              "title": "Segmentation testing performed at least every 12 months",
              "description": "If segmentation is used to isolate the CDE from other networks, penetration tests are performed on segmentation controls as follows:\r\n•\t At least once every 12 months and after any changes to segmentation controls/methods \r\n•\t Covering all segmentation controls/methods in use.\r\n•\t According to the entity’s defined penetration testing methodology.\r\n•\t Confirming that the segmentation controls/methods are operational and effective, and isolate the CDE from all out-of-scope systems.\r\n•\t Confirming effectiveness of any use of isolation to separate systems with differing security levels (see Requirement 2.2.3).\r\n•\t Performed by a qualified internal resource or qualified external third party.\r\n•\t Organizational independence of the tester exists (not required to be a QSA or ASV).",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.4.6",
              "title": "Additional requirement for service providers for segmentation testing",
              "description": "Additional requirement for service providers only: If segmentation is used to isolate the CDE from other networks, penetration tests are performed on segmentation controls as follows: \r\n•\t At least once every six months and after any changes to segmentation controls/methods. \r\n•\t Covering all segmentation controls/methods in use.\r\n•\t According to the entity’s defined penetration testing methodology.\r\n•\t Confirming that the segmentation controls/methods are operational and effective, and isolate the CDE from all out-of-scope systems.\r\n•\t Confirming effectiveness of any use of isolation to separate systems with differing security levels (see Requirement 2.2.3).\r\n•\t Performed by a qualified internal resource or qualified external third party.\r\n•\t Organizational independence of the tester exists (not required to be a QSA or ASV).",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.4.7",
              "title": "Additional requirement for multi-tenant service providers",
              "description": "Additional requirement for third-party hosted/cloud service providers only: Third-party hosted/cloud service providers support to their customers for external penetration testing per Requirement 11.4.3 and 11.4.4.",
              "guidance": "This requirement applies only when the entity being assessed is a multi-tenant service provider.\r\nTo meet this requirement, multi-tenant service providers may either: \r\n•\t Provide evidence to its customers to show that penetration testing has been performed according to Requirements 11.4.3 and 11.4.4 on the customers’ subscribed infrastructure,\r\nOR\r\n•\t Provide prompt access to each of its customers, so customers can perform their own penetration testing.\r\nEvidence provided to customers can include redacted penetration testing results but needs to include sufficient information to prove that all elements of Requirements 11.4.3 and 11.4.4 have been met on the customer’s behalf. Refer also to Appendix A1: Additional PCI DSS Requirements for Multi-Tenant Service Providers.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "11.5",
          "title": "Network intrusions and unexpected file changes are detected and responded to",
          "description": "Network intrusions and unexpected file changes are detected and responded to.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "11.5.1",
              "title": "Intrusion-detection/prevention techniques used on network",
              "description": "Intrusion-detection and/or intrusion-prevention techniques are used to detect and/or prevent intrusions into the network as follows: \r\n•\t All traffic is monitored at the perimeter of the CDE. \r\n•\t All traffic is monitored at critical points in the CDE. \r\n•\t Personnel are alerted to suspected compromises. \r\n•\t All intrusion-detection and prevention engines, baselines, and signatures are kept up to date.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.5.1.1",
              "title": "IDS/IPS addresses covert malware communication",
              "description": "Additional requirement for service providers only: Intrusion-detection and/or intrusion-prevention techniques detect, alert on/prevent, and address covert malware communication channels.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "11.5.2",
              "title": "Change-detection mechanism deployed on critical files",
              "description": "A change-detection mechanism (for example, file integrity monitoring tools) is deployed as follows:\r\n•\t To alert personnel to unauthorized modification (including changes, additions, and deletions) of critical files \r\n•\t To perform critical file comparisons at least once weekly.",
              "guidance": "For change-detection purposes, critical files are usually those that do not regularly change, but the modification of which could indicate a system compromise or risk of compromise. Change-detection mechanisms such as file integrity monitoring products usually come pre-configured with critical files for the related operating system. Other critical files, such as those for custom applications, must be evaluated and defined by the entity (that is, the merchant or service provider).",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "11.6",
          "title": "Unauthorized changes on payment pages are detected and responded to",
          "description": "Unauthorized changes on payment pages are detected and responded to.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "11.6.1",
              "title": "Change-detection mechanism deployed for payment pages",
              "description": "A change- and tamper-detection mechanism is deployed as follows:\r\n•\t To alert personnel to unauthorized modification (including indicators of compromise, changes, additions, and deletions) to the security-impacting HTTP headers and the script contents of payment pages as received by the consumer browser.\r\n•\t The mechanism is configured to evaluate the received HTTP header and payment pages. \r\n•\t The mechanism functions are performed as follows:\r\n     - At least once weeky,\r\n     OR\r\n     - Periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1).",
              "guidance": "This requirement also applies to entities with a webpage(s) that includes a TPSP’s/payment processor’s embedded payment page/form (for example, one or more inline frames or iframes.)\r\nThis requirement does not apply to an entity for scripts in a TPSP’s/payment processor’s embedded payment page/form (for example, one or more iframes), where the entity includes a TPSP’s/payment processor’s payment page/form on its webpage. \r\nScripts in the TPSP’s/payment processor’s embedded payment page/form are the responsibility of the TPSP/payment processor to manage in accordance with this requirement.\r\nThe intention of this requirement is not that an entity installs software in the systems or browsers of its consumers, but rather that the entity uses techniques such as those described under Examples in the PCI DSS Guidance to prevent and detect unexpected script activities.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    },
    {
      "reference": "Req 12",
      "title": "Support Information Security with Organizational Policies and Programs",
      "description": "A strong security policy sets the security tone for the whole entity and informs personnel what is expected of them.",
      "level": 0,
      "isCategory": true,
      "children": [
        {
          "reference": "12.1",
          "title": "A comprehensive information security policy is known and current",
          "description": "A comprehensive information security policy that governs and provides direction for protection of the entity’s information assets is known and current.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.1.1",
              "title": "Overall information security policy established",
              "description": "An overall information security policy is: \r\n•\t Established.\r\n•\t Published.\r\n•\t Maintained.\r\n•\t Disseminated to all relevant personnel, as well as to relevant vendors and business partners.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.1.2",
              "title": "Information security policy reviewed at least annually",
              "description": "The information security policy is:\r\n•\t Reviewed at least once every 12 months.\r\n•\t Updated as needed to reflect changes to business objectives or risks to the environment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.1.3",
              "title": "Security policy clearly defines roles and responsibilities",
              "description": "The security policy clearly defines information security roles and responsibilities for all personnel, and all personnel are aware and acknowledge their information security responsibilities.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.1.4",
              "title": "Responsibility for information security assigned to CISO or equivalent",
              "description": "Responsibility for information security is formally assigned to a Chief Information Security Officer or other information security knowledgeable member of executive management.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.2",
          "title": "Acceptable use policies are defined and implemented",
          "description": "Acceptable use policies for end-user technologies are defined and implemented.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.2.1",
              "title": "Acceptable use policies documented and implemented",
              "description": "Acceptable use policies for end-user technologies are documented and implemented, including:\r\n•\t Explicit approval by authorized parties.\r\n•\t Acceptable uses of the technology.\r\n•\t List of products approved by the company for employee use, including hardware and software.",
              "guidance": "Examples of end-user technologies for which acceptable use policies are expected, include but are not limited to, remote access and wireless technologies, laptops, tablets, mobile phones, and removable electronic media, email usage, and Internet usage.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.3",
          "title": "Risks to the cardholder data environment are formally identified, evaluated, and managed",
          "description": "Targeted risks to the cardholder data environment are formally identified, evaluated, and managed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.3.1",
              "title": "Risk assessment performed annually and upon significant changes",
              "description": "For each PCI DSS requirement that specifies completion of a targeted risk analysis, the analysis is documented and includes:\r\n•\t Identification of the assets being protected. \r\n•\t Identification of the threat(s) that the requirement is protecting against.\r\n•\t Identification of factors that contribute to the likelihood and/or impact of a threat being realized. \r\n•\t Resulting analysis that determines, and includes justification for, how the frequency or processes defined by the entity to meet the requirement minimize the likelihood and/or impact of the threat being realized.\r\n•\t Review of each targeted risk analysis at least once every 12 months to determine whether the results are still valid or if an updated risk analysis is needed\r\n•\t Performance of updated risk analyses when needed, as determined by the annual review.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.3.2",
              "title": "Targeted risk analysis performed for each PCI DSS flexible requirement",
              "description": "A targeted risk analysis is performed for each PCI DSS requirement that the entity meets with the customized approach, to include:\r\n•\t Documented evidence detailing each element specified in Appendix B: Guidance and Instructions for Using Customized Approach (including, at a minimum, a controls matrix and risk analysis).\r\n•\t Approval of documented evidence by senior management.\r\n•\t Performance of the targeted analysis of risk at least once every 12 months.",
              "guidance": "This only applies to entities using a Customized Approach.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.3.3",
              "title": "Cryptographic cipher suites and protocols documented and reviewed",
              "description": "Cryptographic cipher suites and protocols in use are documented and reviewed at least once every 12 months, including at least the following:\r\n•\t An up-to-date inventory of all cryptographic cipher suites and protocols in use, including purpose and where used.\r\n•\t Active monitoring of industry trends regarding continued viability of all cryptographic cipher suites and protocols in use.\r\n•\t Documentation of a plan to respond to anticipated changes in cryptographic vulnerabilities.",
              "guidance": "The requirement applies to all cryptographic cipher suites and protocols used to meet PCI DSS requirements, including, but not limited to, those used to render PAN unreadable in storage and transmission, to protect passwords, and as part of authenticating access. \r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.3.4",
              "title": "Hardware and software technologies reviewed at least annually",
              "description": "Hardware and software technologies in use are reviewed at least once every 12 months, including at least the following:\r\n•\t Analysis that the technologies continue to receive security fixes from vendors promptly.\r\n•\t Analysis that the technologies continue to support (and do not preclude) the entity’s PCI DSS compliance.\r\n•\t Documentation of any industry announcements or trends related to a technology, such as when a vendor has announced “end of life” plans for a technology.\r\n•\t Documentation of a plan, approved by senior management, to remediate outdated technologies, including those for which vendors have announced “end of life” plans.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.4",
          "title": "PCI DSS compliance is managed",
          "description": "PCI DSS compliance is managed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.4.1",
              "title": "Additional requirement for service providers for executive responsibility",
              "description": "Additional requirement for service providers only: Responsibility is established by executive management for the protection of cardholder data and a PCI DSS compliance program to include: \r\n•\t Overall accountability for maintaining PCI DSS compliance.\r\n•\t Defining a charter for a PCI DSS compliance program and communication to executive management.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nExecutive management may include C-level positions, board of directors, or equivalent. The specific titles will depend on the particular organizational structure.\r\nResponsibility for the PCI DSS compliance program may be assigned to individual roles and/or to business units within the organization.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.4.2",
              "title": "Additional requirement for service providers for quarterly reviews",
              "description": "Additional requirement for service providers only: Reviews are performed at least once every three months to confirm personnel are performing their tasks in accordance with all security policies and all operational procedures. Reviews are performed by personnel other than those responsible for performing the given task and include, but not limited to, the following tasks: \r\n• \tDaily log reviews. \r\n• \tConfiguration reviews for network security controls. \r\n• \t Applying configuration standards to new systems. \r\n• \t Responding to security alerts. \r\n•  \tChange-management processes.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.4.2.1",
              "title": "Additional requirement for service providers for documentation of reviews",
              "description": "Additional requirement for service providers only: Reviews conducted in accordance with Requirement 12.4.2 are documented to include: \r\n•\t Results of the reviews. \r\n•\t Documented remediation actions taken for any tasks that were found to not be performed at Requirement 12.4.2.\r\n•\t Review and sign-off of results by personnel assigned responsibility for the PCI DSS compliance program.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.5",
          "title": "PCI DSS scope is documented and validated",
          "description": "PCI DSS scope is documented and validated.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.5.1",
              "title": "Inventory of system components in scope maintained",
              "description": "An inventory of system components that are in scope for PCI DSS, including a description of function/use, is maintained and kept current.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.5.2",
              "title": "PCI DSS scope documented and confirmed at least annually",
              "description": "PCI DSS scope is documented and confirmed by the entity at least once every 12 months and upon significant change to the in-scope environment. At a minimum, the scoping validation includes:\r\n•\t Identifying all data flows for the various payment stages (for example, authorization, capture settlement, chargebacks, and refunds) and acceptance channels (for example, card-present, card-not-present, and e-commerce).\r\n•\t Updating all data-flow diagrams per Requirement 1.2.4.\r\n•\t Identifying all locations where account data is stored, processed, and transmitted, including but not limited to: 1) any locations outside of the currently defined CDE, 2) applications that process CHD, 3) transmissions between systems and networks, and 4) file backups.\r\n•\t Identifying all system components in the CDE, connected to the CDE, or that could impact security of the CDE.\r\n•\t Identifying all segmentation controls in use and the environment(s) from which the CDE is segmented, including justification for environments being out of scope.\r\n•\t Identifying all connections from third-party entities with access to the CDE.\r\n•\t Confirming that all identified data flows, account data, system components, segmentation controls, and connections from third parties with access to the CDE are included in scope.",
              "guidance": "This annual confirmation of PCI DSS scope is an activity expected to be performed by the entity under assessment, and is not the same, nor is it intended to be replaced by, the scoping confirmation performed by the entity’s assessor during the annual assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.5.2.1",
              "title": "Additional requirement for service providers for scope confirmation every 6 months",
              "description": "Additional requirement for service providers only: PCI DSS scope is documented and confirmed by the entity at least once every six months and after significant changes. At a minimum, the scoping validation includes all the elements specified in Requirement 12.5.2.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.5.3",
              "title": "Additional requirement for service providers for impact of changes on PCI DSS scope",
              "description": "Additional requirement for service providers only: Significant changes to organizational structure result in a documented (internal) review of the impact to PCI DSS scope and applicability of controls, with results communicated to executive management.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.6",
          "title": "Security awareness education is an ongoing activity",
          "description": "Security awareness education is an ongoing activity",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.6.1",
              "title": "Formal security awareness program implemented",
              "description": "A formal security awareness program is implemented to make all personnel aware of the entity’s information security policy and procedures and their role in protecting the cardholder data.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.6.2",
              "title": "Security awareness program reviewed at least annually",
              "description": "The security awareness program is: \r\n•\t Reviewed at least once every 12 months, and \r\n•\t Updated as needed to address any new threats and vulnerabilities that may impact the security of the entity’s cardholder data and/or sensitive authentication data, or the information provided to personnel about their role in protecting cardholder data.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.6.3",
              "title": "Personnel receive security awareness training",
              "description": "Personnel receive security awareness training as follows: \r\n•\t Upon hire and at least once every 12 months.\r\n•\t Multiple methods of communication are used.\r\n•\t Personnel acknowledge at least once every 12 months that they have read and understood the information security policy and procedures.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.6.3.1",
              "title": "Security awareness training includes awareness of threats",
              "description": "Security awareness training includes awareness of threats and vulnerabilities that could impact the security of cardholder data and/or sensitive authentication data, including but not limited to:\r\n•\t Phishing and related attacks. \r\n•\t Social engineering.",
              "guidance": "See Requirement 5.4.1 for guidance on the difference between technical and automated controls to detect and protect users from phishing attacks, and this requirement for providing users security awareness training about phishing and social engineering. These are two separate and distinct requirements, and one is not met by implementing controls required by the other one.\r\nThis requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.6.3.2",
              "title": "Security awareness training includes acceptable use of end-user technologies",
              "description": "Security awareness training includes awareness about the acceptable use of end-user technologies in accordance with Requirement 12.2.1.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.7",
          "title": "Personnel are screened to reduce risks from insider threats",
          "description": "Personnel are screened to reduce risks from insider threats.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.7.1",
              "title": "Potential personnel screened prior to hire",
              "description": "Potential personnel who will have access to the CDE are screened, within the constraints of local laws, prior to hire to minimize the risk of attacks from internal sources.",
              "guidance": "For those potential personnel to be hired for positions such as store cashiers, who only have access to one card number at a time when facilitating a transaction, this requirement is a recommendation only.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.8",
          "title": "Risk to information assets associated with third-party service providers is managed",
          "description": "Risk to information assets associated with third-party service provider (TPSP) relationships is managed.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.8.1",
              "title": "List of TPSPs with which account data is shared maintained",
              "description": "A list of all third-party service providers (TPSPs) with which account data is shared or that could affect the security of account data is maintained, including a description for each of the services provided.",
              "guidance": "The use of a PCI DSS compliant TPSP does not make an entity PCI DSS compliant, nor does it remove the entity’s responsibility for its own PCI DSS compliance.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.8.2",
              "title": "Written agreements with TPSPs maintained",
              "description": "Written agreements with TPSPs are maintained as follows: \r\n•\t Written agreements are maintained with all TPSPs with which account data is shared or that could affect the security of the CDE.\r\n•\t Written agreements include acknowledgments from TPSPs that TPSPs are responsible for the security of account data the TPSPs possess or otherwise store, process, or transmit on behalf of the entity, or to the extent that the TPSP could impact the security of the entity’s cardholder data and/or sensitive authentication data.",
              "guidance": "The exact wording of an agreement will depend on the details of the service being provided, and the responsibilities assigned to each party. The agreement does not have to include the exact wording provided in this requirement.\r\nThe TPSP’s written acknowledgment is a confirmation that states the TPSP is responsible for the security of the account data it may store, process, or transmit on behalf of the customer or to the extent the TPSP may impact the security of a customer’s cardholder data and/or sensitive authentication data. \r\nEvidence that a TPSP is meeting PCI DSS requirements is not the same as a written acknowledgment specified in this requirement. For example, a PCI DSS Attestation of Compliance (AOC), a declaration on a company’s website, a policy statement, a responsibility matrix, or other evidence not included in a written agreement is not a written acknowledgment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.8.3",
              "title": "Established process for engaging TPSPs includes due diligence",
              "description": "An established process is implemented for engaging TPSPs, including proper due diligence prior to engagement.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.8.4",
              "title": "Program to monitor TPSPs' PCI DSS compliance status",
              "description": "A program is implemented to monitor TPSPs’ PCI DSS compliance status at least once every 12 months.",
              "guidance": "Where an entity has an agreement with a TPSP for meeting PCI DSS requirements on behalf of the entity (for example, via a firewall service), the entity must work with the TPSP to make sure the applicable PCI DSS requirements are met. If the TPSP does not meet those applicable PCI DSS requirements, then those requirements are also “not in place” for the entity.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.8.5",
              "title": "Information maintained about which PCI DSS requirements managed by each TPSP",
              "description": "Information is maintained about which PCI DSS requirements are managed by each TPSP, which are managed by the entity, and any that are shared between the TPSP and the entity.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.9",
          "title": "Third-party service providers support their customers' PCI DSS compliance",
          "description": "Third-party service providers (TPSPs) support their customers’ PCI DSS compliance.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.9.1",
              "title": "Additional requirement for TPSPs to acknowledge responsibility",
              "description": "Additional requirement for service providers only: TPSPs provide written agreements to customers that include acknowledgments that TPSPs are responsible for the security of account data the TPSP possesses or otherwise stores, processes, or transmits on behalf of the customer, or to the extent that the TPSP could impact the security of the customer’s cardholder data and/or sensitive authentication data.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.\r\nThe exact wording of an agreement will depend on the details of the service being provided, and the responsibilities assigned to each party. The agreement does not have to include the exact wording provided in this requirement.\r\nThe TPSP’s written acknowledgment is a confirmation that states the TPSP is responsible for the security of the account data it may store, process, or transmit on behalf of the customer or to the extent that the TPSP could impact the security of a customer’s cardholder data and/or sensitive authentication data. \r\nEvidence that a TPSP is meeting PCI DSS requirements is not the same as a written agreement specified in this requirement. For example, a PCI DSS Attestation of Compliance (AOC), a declaration on a company’s website, a policy statement, a responsibility matrix, or other evidence not included in a written agreement is not a written acknowledgment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.9.2",
              "title": "Additional requirement for TPSPs to support customer requests for information",
              "description": "Additional requirement for service providers only: TPSPs support their customers’ requests for information to meet Requirements 12.8.4 and 12.8.5 by providing the following upon customer request:\r\n•\t PCI DSS compliance status information (Requirement 12.8.4).\r\n•\t Information about which PCI DSS requirements are the responsibility of the TPSP and which are the responsibility of the customer, including any shared responsibilities (Requirement 12.8.5), for any service the TPSP provides that meets a PCI DSS requirement(s) on behalf of customers or that can impact security of customers’ cardholder data and/or sensitive authentication data.",
              "guidance": "This requirement applies only when the entity being assessed is a service provider.",
              "level": 2,
              "isCategory": false
            }
          ]
        },
        {
          "reference": "12.10",
          "title": "Suspected and confirmed security incidents are responded to immediately",
          "description": "Suspected and confirmed security incidents that could impact the CDE are responded to immediately.",
          "level": 1,
          "isCategory": true,
          "children": [
            {
              "reference": "12.10.1",
              "title": "Incident response plan exists and is available",
              "description": "An incident response plan exists and is ready to be activated in the event of a suspected or confirmed security incident. The plan includes, but is not limited to: \r\n•\t Roles, responsibilities, and communication and contact strategies in the event of a suspected or confirmed security incident, including notification of payment brands and acquirers, at a minimum.\r\n•\t Incident response procedures with specific containment and mitigation activities for different types of incidents.\r\n•\t Business recovery and continuity procedures.\r\n•\t Data backup processes.\r\n•\t Analysis of legal requirements for reporting compromises.\r\n•\t Coverage and responses of all critical system components.\r\n•\t Reference or inclusion of incident response procedures from the payment brands.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.2",
              "title": "Incident response plan reviewed and tested at least annually",
              "description": "At least once every 12 months, the security incident response plan is: \r\n•\t Reviewed and the content is updated as needed.\r\n•\t Tested, including all elements listed in Requirement 12.10.1.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.3",
              "title": "Specific personnel designated for 24/7 response",
              "description": "Specific personnel are designated to be available on a 24/7 basis to respond to suspected or confirmed security incidents.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.4",
              "title": "Personnel responsible for responding to incidents appropriately trained",
              "description": "Personnel responsible for responding to suspected and confirmed security incidents are appropriately and periodically trained on their incident response responsibilities.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.4.1",
              "title": "Frequency of training for incident response personnel defined",
              "description": "The frequency of periodic training for incident response personnel is defined in the entity’s targeted risk analysis which is performed according to all elements specified in Requirement 12.3.1.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.5",
              "title": "Incident response plan includes monitoring and responding to alerts",
              "description": "The security incident response plan includes monitoring and responding to alerts from security monitoring systems, including but not limited to: \r\n•\t Intrusion-detection and intrusion-prevention systems. \r\n•\t Network security controls.\r\n•\t Change-detection mechanisms for critical files.\r\n•\t The change-and tamper-detection mechanism for payment pages. This bullet is a best practice until its effective date; refer to",
              "guidance": "below for details. \r\n•\t Detection of unauthorized wireless access points.\r\nApplicability Notes\r\nThe bullet above (for monitoring and responding to alerts from a change- and tamper-detection mechanism for payment pages) is a best practice until 31 March 2025, after which it will be required as part of Requirement 12.10.5 and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.6",
              "title": "Incident response plan modified and evolved based on lessons learned",
              "description": "The security incident response plan is modified and evolved according to lessons learned and to incorporate industry developments.",
              "level": 2,
              "isCategory": false
            },
            {
              "reference": "12.10.7",
              "title": "Incident response procedures in place for unexpected PAN discovery",
              "description": "Incident response procedures are in place, to be initiated upon the detection of stored PAN anywhere it is not expected, and include:\r\n•\t Determining what to do if PAN is discovered outside the CDE, including its retrieval, secure deletion, and/or migration into the currently defined CDE, as applicable.\r\n•\t Identifying whether sensitive authentication data is stored with PAN. \r\n•\t Determining where the account data came from and how it ended up where it was not expected.\r\n•\t Remediating data leaks or process gaps that resulted in the account data being where it was not expected.",
              "guidance": "This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment.",
              "level": 2,
              "isCategory": false
            }
          ]
        }
      ]
    }
  ]
}